[
    {
        "title": {
            "en": "** ATTENTION ** defective versions of the Tankerkönig adapter cause massive problems on the server!",
            "de": "** ACHTUNG ** Defekte Versionen des Tankerkönig-Adapters verursachen massive Probleme auf dem Server!",
            "ru": "** ВНИМАНИЕ ** Дефектные версии адаптера Tankerkönig вызывают серьезные проблемы на сервере!",
            "pt": "** ATENÇÃO ** versões defeituosas do adaptador Tankerkönig causam enormes problemas no servidor!",
            "nl": "** LET OP ** Defecte versies van de Tankerkönig-adapter veroorzaken enorme problemen op de server!",
            "fr": "** ATTENTION ** les versions défectueuses de l'adaptateur Tankerkönig causent de gros problèmes sur le serveur!",
            "it": "** ATTENZIONE ** le versioni difettose dell'adattatore Tankerkönig causano enormi problemi sul server!",
            "es": "** ATENCIÓN ** las versiones defectuosas del adaptador Tankerkönig causan problemas masivos en el servidor!",
            "pl": "** UWAGA ** wadliwe wersje adaptera Tankerkönig powodują ogromne problemy na serwerze!",
            "zh-cn": "**注意**Tankerkönig适配器的有缺陷版本会导致服务器出现大量问题！"
        },
        "content": {
            "en": "We have been repeatedly reminded by the Tankerkönig-Team that users with one of the defective versions between 1.0.5 and 2.0.4, are blocking their servers.<br>Please install only versions before 1.0.5 or after 2.0.4.",
            "de": "Wir wurden wiederholt vom Tankerkönig-Team daran erinnert, dass Benutzer mit einer der fehlerhaften Versionen zwischen 1.0.5 und 2.0.4 ihre Server blockieren.<br>Bitte installieren Sie nur Versionen vor 1.0.5 oder nach 2.0.4.",
            "ru": "Команда Tankerkönig-Team неоднократно напоминала нам, что пользователи с одной из дефектных версий между 1.0.5 и 2.0.4 блокируют свои серверы. <br> Пожалуйста, устанавливайте только версии до 1.0.5 или после 2.0.4.",
            "pt": "Temos sido repetidamente lembrados pelo Tankerkönig-Team que os usuários com uma das versões defeituosas entre 1.0.5 e 2.0.4, estão bloqueando seus servidores.<br>Por favor, instale apenas versões anteriores a 1.0.5 ou posteriores à 2.0.4.",
            "nl": "We hebben het Tankerkönig-team herhaaldelijk herinnerd aan het feit dat gebruikers met een van de defecte versies tussen 1.0.5 en 2.0.4 hun servers blokkeren.<br>Installeer alstublieft alleen versies vóór 1.0.5 of na 2.0.4.",
            "fr": "L'équipe Tankerkönig nous a rappelé à plusieurs reprises que les utilisateurs qui utilisent l'une des versions défectueuses entre 1.0.5 et 2.0.4 bloquent leurs serveurs.<br>Veuillez installer uniquement les versions antérieures à 1.0.5 ou ultérieure.",
            "it": "Ci è stato ripetutamente ricordato dal Team Tankerkönig che gli utenti con una delle versioni difettose tra 1.0.5 e 2.0.4 stanno bloccando i loro server.<br>Si prega di installare solo versioni precedenti alla 1.0.5 o successive alla 2.0.4.",
            "es": "El equipo de Tankerkönig nos ha recordado repetidamente que los usuarios con una de las versiones defectuosas entre 1.0.5 y 2.0.4 están bloqueando sus servidores.<br>Instale solo las versiones anteriores a 1.0.5 o posteriores a 2.0.4.",
            "pl": "Zespół Tankerkönig wielokrotnie przypominał, że użytkownicy z jedną z wadliwych wersji między 1.0.5 a 2.0.4 blokują swoje serwery. <br> Zainstaluj tylko wersje przed 1.0.5 lub po 2.0.4.",
            "zh-cn": "Tankerkönig-Team一再提醒我们，有一个1.0.5和2.0.4之间缺陷版本的用户正在阻止他们的服务器。<br>请仅安装1.0.5之前或2.0.4之后的版本。"
        },
        "id": "tanker",
        "created": "2019-02-24T00:00:00.000Z",
        "class": "danger",
        "fa-icon": "bolt",
        "conditions": {
            "tankerkoenig": "smaller(2.0.5)"
        }
    },
    {
        "title": {
            "en": "Broadlink not maintained anymore",
            "de": "Broadlink wird nicht mehr gepflegt",
            "ru": "Broadlink больше не поддерживается",
            "pt": "O Broadlink não é mais mantido",
            "nl": "Broadlink niet meer onderhouden",
            "fr": "Broadlink n'est plus maintenu",
            "it": "Broadlink non mantenuto più",
            "es": "Broadlink no se mantiene más",
            "pl": "Broadlink nie jest już obsługiwany",
            "zh-cn": "Broadlink不再维护了"
        },
        "content": {
            "en": "This project is no longer maintained for personal reasons. Please use the ioBroker.broadlink2 instead.",
            "de": "Dieses Projekt wird aus persönlichen Gründen nicht mehr gepflegt. Bitte verwenden Sie stattdessen den ioBroker.broadlink2.",
            "ru": "Этот проект больше не поддерживается по личным причинам. Пожалуйста, используйте вместо этого ioBroker.broadlink2.",
            "pt": "Este projeto não é mais mantido por motivos pessoais. Por favor, use o ioBroker.broadlink2 em seu lugar.",
            "nl": "Dit project wordt om persoonlijke redenen niet langer onderhouden. Gebruik in plaats daarvan de ioBroker.broadlink2.",
            "fr": "Ce projet n'est plus maintenu pour des raisons personnelles. Veuillez utiliser le ioBroker.broadlink2 à la place.",
            "it": "Questo progetto non è più mantenuto per ragioni personali. Utilizzare invece ioBroker.broadlink2.",
            "es": "Este proyecto ya no se mantiene por razones personales. Por favor use el ioBroker.broadlink2 en su lugar.",
            "pl": "Ten projekt nie jest już utrzymywany z powodów osobistych. Zamiast tego użyj pliku ioBroker.broadlink2.",
            "zh-cn": "由于个人原因，该项目不再维护。请改用ioBroker.broadlink2。"
        },
        "id": "broadlink",
        "created": "2019-03-13T00:00:00.000Z",
        "conditions": {
            "broadlink": "installed",
            "broadlink2": "!installed"
        }
    },
    {
        "title": {
            "en": "Adapter 'Radar' will not be further developed!",
            "de": "Radar wird nicht weiterentwickelt!",
            "ru": "Адаптер 'Radar' больше не будет развиваться!",
            "pt": "O Adaptador 'Radar' não será mais desenvolvido!",
            "nl": "Adapter 'Radar' wordt niet verder ontwikkeld!",
            "fr": "L'adaptateur 'Radar' ne sera plus développé!",
            "it": "L'adattatore 'Radar' non sarà ulteriormente sviluppato!",
            "es": "¡El adaptador 'Radar' no se desarrollará más!",
            "pl": "Adapter 'Radar' nie będzie dalej rozwijany!",
            "zh-cn": "适配器'Radar'将不再进一步开发！"
        },
        "content": {
            "en": "Due to the development of the ioBroker.radar2 adapter, the further development of the ioBroker.radar adapter has been discontinued. Please install the new adapter to get more features.",
            "de": "Aufgrund der Entwicklung des ioBroker.radar2 Adapters, wurde die Weiterentwicklung des ioBroker.radar-Adapters eingestellt. Bitte installieren Sie den neuen Adapter um weitere Funktionen zu bekommen.",
            "ru": "В связи с разработкой адаптера ioBroker.radar2 дальнейшая разработка адаптера ioBroker.radar была прекращена. Пожалуйста, установите новый адаптер, чтобы получить больше возможностей.",
            "pt": "Devido ao desenvolvimento do adaptador ioBroker.radar2, o desenvolvimento adicional do adaptador ioBroker.radar foi descontinuado. Por favor, instale o novo adaptador para obter mais recursos.",
            "nl": "Vanwege de ontwikkeling van de ioBroker.radar2-adapter is de verdere ontwikkeling van de ioBroker.radar-adapter stopgezet. Installeer de nieuwe adapter om meer functies te krijgen.",
            "fr": "En raison du développement de l'adaptateur ioBroker.radar2, le développement de l'adaptateur ioBroker.radar a été arrêté. Veuillez installer le nouvel adaptateur pour obtenir plus de fonctionnalités.",
            "it": "A causa dello sviluppo dell'adattatore ioBroker.radar2, l'ulteriore sviluppo dell'adattatore ioBroker.radar è stato interrotto. Si prega di installare il nuovo adattatore per ottenere più funzionalità.",
            "es": "Debido al desarrollo del adaptador ioBroker.radar2, el desarrollo adicional del adaptador ioBroker.radar se ha interrumpido. Instale el nuevo adaptador para obtener más características.",
            "pl": "Dzięki rozwojowi adaptera ioBroker.radar2, dalszy rozwój adaptera ioBroker.radar został przerwany. Zainstaluj nowy adapter, aby uzyskać więcej funkcji.",
            "zh-cn": "由于ioBroker.radar2适配器的开发，ioBroker.radar适配器的进一步开发已经停止。 请安装新适配器以获得更多功能。"
        },
        "id": "radar",
        "created": "2019-03-22T00:00:00.000Z",
        "conditions": {
            "radar": "installed",
            "radar2": "!installed"
        }
    },
    {
        "title": {
            "en": "Please update ioBroker.weatherunderground",
            "de": "Bitte updaten Sie ioBroker.weatherunderground",
            "ru": "Пожалуйста, обновление ioBroker.weatherunderground",
            "pt": "Por favor, atualize ioBroker.weatherunderground",
            "nl": "Update ioBroker.weatherunderground",
            "fr": "Veuillez mettre à jour ioBroker.weatherunderground",
            "it": "Si prega di aggiornare ioBroker.weatherunderground",
            "es": "Por favor, actualice ioBroker.weatherunderground",
            "pl": "Proszę aktualizacja ioBroker.weatherunderground",
            "zh-cn": "请更新的ioBroker。weatherunderground"
        },
        "content": {
            "en": "Due to changes to the API, versions below 3.0.0 no longer work. Please update your version of ioBroker.weatherunderground.",
            "de": "Wegen Änderungen der API, funktionieren Versionen unter 3.0.0 nicht mehr. Bitte aktualisieren Sie Ihre Version von ioBroker.weatherunderground.",
            "ru": "Из-за изменений в API, версий ниже 3.0.0 больше не работают. Пожалуйста, обновите вашу версию ioBroker.weatherunderground.",
            "pt": "Devido a alterações para a API, versões abaixo 3.0.0 não funcionam mais. Por favor, atualize sua versão do ioBroker.weatherunderground.",
            "nl": "Door veranderingen aan de API versies hieronder 3.0.0 niet meer werken. Update uw versie van ioBroker.weatherunderground.",
            "fr": "En raison des changements de l'API, les versions ci-dessous 3.0.0 ne fonctionnent plus. Veuillez mettre à jour votre version de ioBroker.weatherunderground.",
            "it": "A causa di modifiche alle API, versioni di seguito 3.0.0 non funzionano più. Si prega di aggiornare la tua versione di ioBroker.weatherunderground.",
            "es": "Debido a cambios en el API, las versiones a continuación 3.0.0 ya no funcionan. Por favor, actualice su versión de ioBroker.weatherunderground.",
            "pl": "Ze względu na zmiany w API w wersji poniżej 3.0.0 już nie pracują. Proszę zaktualizować swoją wersję ioBroker.weatherunderground.",
            "zh-cn": "由于变化的API，下文版本为3.0.0不再工作。 请更新版本的的ioBroker。weatherunderground的。"
        },
        "id": "weatherundergroundAdapter",
        "fa-icon": "sun-o",
        "created": "2019-03-24T00:00:00.000Z",
        "conditions": {
            "weatherunderground": "smaller(3.0.0)"
        }
    },
    {
        "title": {
            "en": "Node.JS versions smaller than 8 will be soon deprecated",
            "de": "Node.JS-Versionen, die kleiner als 8 sind, werden bald nicht mehr unterstützt",
            "ru": "Версии Node.JS, меньшие 8, скоро будут устаревшими",
            "pt": "Versões do Node.JS menores que 8 serão descontinuadas em breve",
            "nl": "Node.JS-versies kleiner dan 8 worden binnenkort verouderd",
            "fr": "Les versions de Node.JS inférieures à 8 seront bientôt obsolètes",
            "it": "Le versioni di Node.JS inferiori a 8 saranno presto deprecate",
            "es": "Las versiones de Node.JS más pequeñas que 8 pronto serán desaprobadas",
            "pl": "Wersje Node.JS mniejsze niż 8 zostaną wkrótce wycofane",
            "zh-cn": "小于8的Node.JS版本将很快被弃用"
        },
        "content": {
            "en": "With the upcoming version 2 of the JS-controller, the support of Node.JS versions smaller than 8.x.x will be discontinued. Please update your system to a higher version. We recommend the Node.JS version 10.x.x.",
            "de": "Mit der kommenden Version 2 des JS-Controllers wird die Unterstützung von Node.JS-Versionen kleiner als 8.x.x eingestellt. Bitte aktualisieren Sie Ihr System auf eine höhere Version. Wir empfehlen die Node.JS-Version 10.x.x.",
            "ru": "С выходом второй версии JS-контроллера поддержка версий Node.JS, меньших 8.x.x, будет прекращена. Пожалуйста, обновите вашу систему до более поздней версии. Мы рекомендуем Node.JS версии 10.x.x.",
            "pt": "Com a próxima versão 2 do controlador JS, o suporte às versões do Node.JS menores que 8.x.x será descontinuado. Atualize seu sistema para uma versão superior. Recomendamos a versão 10.x.x do Node.JS.",
            "nl": "Met de komende versie 2 van de JS-controller wordt de ondersteuning van Node.JS-versies kleiner dan 8.x.x stopgezet. Werk uw systeem bij naar een hogere versie. We raden de Node.JS-versie 10.x.x aan.",
            "fr": "Avec la prochaine version 2 du contrôleur JS, le support des versions de Node.JS inférieures à 8.x.x sera supprimé. Veuillez mettre à jour votre système avec une version supérieure. Nous recommandons la version 10.x.x de Node.JS.",
            "it": "Con la prossima versione 2 del controller JS, il supporto delle versioni Node.JS inferiori a 8.x.x verrà sospeso. Si prega di aggiornare il sistema a una versione successiva. Consigliamo Node.JS versione 10.x.x.",
            "es": "Con la próxima versión 2 del controlador JS, se suspenderá el soporte de las versiones Node.JS más pequeñas que 8.x.x. Actualice su sistema a una versión superior. Recomendamos el Node.JS versión 10.x.x.",
            "pl": "W nadchodzącej wersji 2 kontrolera JS obsługa Node.JS w wersji mniejszej niż 8.x.x zostanie przerwana. Zaktualizuj system do wyższej wersji. Zalecamy wersję 10.x.x. Node.JS",
            "zh-cn": "随着即将发布的JS-controller版本2，将不再支持小于8.x.x的Node.JS版本。请更新您的系统到更高版本。我们建议使用Node.JS版本10.x.x。"
        },
        "id": "js-controller",
        "node-version": "smaller(8.0.0)",
        "class": "warning",
        "fa-icon": "ban",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "admin": "bigger(3.6.10)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the simple-api adapter smaller than 2.1.2",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem simple-api-Adapter, der kleiner als 2.1.2 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером simple-api меньше 2.1.2",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador simple-api menor que 2.1.2",
            "nl": "JS-Controller 2.x is niet compatibel met de simple-api-adapter kleiner dan 2.1.2",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur simple-api inférieur à 2.1.2",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore simple-api più piccolo di 2.1.2.",
            "es": "JS-Controller 2.x no es compatible con el adaptador simple-api más pequeño que 2.1.2",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem simple-api mniejszym niż 2.1.2",
            "zh-cn": "JS-Controller 2.x与小于2.1.2的simple-api适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the simple-api adapter with a version prior to 2.1.2. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem simple-api-Adapter mit einer Version vor 2.1.2 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером simple-api с версией, предшествующей 2.1.2. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador simple-api com uma versão anterior ao 2.1.2. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de simple-api-adapter met een versie ouder dan 2.1.2. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur simple-api avec une version antérieure à 2.1.2. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore simple-api con una versione precedente a 2.1.2. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador simple-api con una versión anterior a 2.1.2. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem simple-api z wersją wcześniejszą niż 2.1.2. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与2.1.2之前的版本的simple-api适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "simple-api",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "simple-api": "smaller(2.1.2)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the email adapter smaller than 1.0.5",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem email-Adapter, der kleiner als 1.0.5 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером email меньше 1.0.5",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador email menor que 1.0.5",
            "nl": "JS-Controller 2.x is niet compatibel met de email-adapter kleiner dan 1.0.5",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur email inférieur à 1.0.5",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore email più piccolo di 1.0.5.",
            "es": "JS-Controller 2.x no es compatible con el adaptador email más pequeño que 1.0.5",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem email mniejszym niż 1.0.5",
            "zh-cn": "JS-Controller 2.x与小于1.0.5的email适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the email adapter with a version prior to 1.0.5. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem email-Adapter mit einer Version vor 1.0.5 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером email с версией, предшествующей 1.0.5. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador email com uma versão anterior ao 1.0.5. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de email-adapter met een versie ouder dan 1.0.5. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur email avec une version antérieure à 1.0.5. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore email con una versione precedente a 1.0.5. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador email con una versión anterior a 1.0.5. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem email z wersją wcześniejszą niż 1.0.5. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.0.5之前的版本的email适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "email",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "email": "smaller(1.0.5)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the pushover adapter smaller than 1.1.1",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem pushover-Adapter, der kleiner als 1.1.1 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером pushover меньше 1.1.1",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador pushover menor que 1.1.1",
            "nl": "JS-Controller 2.x is niet compatibel met de pushover-adapter kleiner dan 1.1.1",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur pushover inférieur à 1.1.1",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore pushover più piccolo di 1.1.1.",
            "es": "JS-Controller 2.x no es compatible con el adaptador pushover más pequeño que 1.1.1",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem pushover mniejszym niż 1.1.1",
            "zh-cn": "JS-Controller 2.x与小于1.1.1的pushover适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the pushover adapter with a version prior to 1.1.1. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem pushover-Adapter mit einer Version vor 1.1.1 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером pushover с версией, предшествующей 1.1.1. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador pushover com uma versão anterior ao 1.1.1. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de pushover-adapter met een versie ouder dan 1.1.1. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur pushover avec une version antérieure à 1.1.1. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore pushover con una versione precedente a 1.1.1. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador pushover con una versión anterior a 1.1.1. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem pushover z wersją wcześniejszą niż 1.1.1. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.1.1之前的版本的pushover适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "pushover",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "pushover": "smaller(1.1.1)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the hue adapter smaller than 1.2.4",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem hue-Adapter, der kleiner als 1.2.4 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером hue меньше 1.2.4",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador hue menor que 1.2.4",
            "nl": "JS-Controller 2.x is niet compatibel met de hue-adapter kleiner dan 1.2.4",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur hue inférieur à 1.2.4",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore hue più piccolo di 1.2.4.",
            "es": "JS-Controller 2.x no es compatible con el adaptador hue más pequeño que 1.2.4",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem hue mniejszym niż 1.2.4",
            "zh-cn": "JS-Controller 2.x与小于1.2.4的hue适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the hue adapter with a version prior to 1.2.4. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem hue-Adapter mit einer Version vor 1.2.4 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером hue с версией, предшествующей 1.2.4. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador hue com uma versão anterior ao 1.2.4. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de hue-adapter met een versie ouder dan 1.2.4. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur hue avec une version antérieure à 1.2.4. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore hue con una versione precedente a 1.2.4. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador hue con una versión anterior a 1.2.4. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem hue z wersją wcześniejszą niż 1.2.4. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.2.4之前的版本的hue适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "hue",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "hue": "smaller(1.2.4)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the node-red adapter smaller than 1.10.1",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem node-red-Adapter, der kleiner als 1.10.1 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером node-red меньше 1.10.1",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador node-red menor que 1.10.1",
            "nl": "JS-Controller 2.x is niet compatibel met de node-red-adapter kleiner dan 1.10.1",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur node-red inférieur à 1.10.1",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore node-red più piccolo di 1.10.1.",
            "es": "JS-Controller 2.x no es compatible con el adaptador node-red más pequeño que 1.10.1",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem node-red mniejszym niż 1.10.1",
            "zh-cn": "JS-Controller 2.x与小于1.10.1的node-red适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the node-red adapter with a version prior to 1.10.1. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem node-red-Adapter mit einer Version vor 1.10.1 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером node-red с версией, предшествующей 1.10.1. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador node-red com uma versão anterior ao 1.10.1. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de node-red-adapter met een versie ouder dan 1.10.1. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur node-red avec une version antérieure à 1.10.1. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore node-red con una versione precedente a 1.10.1. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador node-red con una versión anterior a 1.10.1. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem node-red z wersją wcześniejszą niż 1.10.1. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.10.1之前的版本的node-red适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "node-red",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "node-red": "smaller(1.10.1)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the vis adapter smaller than 1.2.2",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem vis-Adapter, der kleiner als 1.2.2 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером vis меньше 1.2.2",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador vis menor que 1.2.2",
            "nl": "JS-Controller 2.x is niet compatibel met de vis-adapter kleiner dan 1.2.2",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur vis inférieur à 1.2.2",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore vis più piccolo di 1.2.2.",
            "es": "JS-Controller 2.x no es compatible con el adaptador vis más pequeño que 1.2.2",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem vis mniejszym niż 1.2.2",
            "zh-cn": "JS-Controller 2.x与小于1.2.2的vis适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the vis adapter with a version prior to 1.2.2. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem vis-Adapter mit einer Version vor 1.2.2 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером vis с версией, предшествующей 1.2.2. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador vis com uma versão anterior ao 1.2.2. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de vis-adapter met een versie ouder dan 1.2.2. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur vis avec une version antérieure à 1.2.2. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore vis con una versione precedente a 1.2.2. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador vis con una versión anterior a 1.2.2. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem vis z wersją wcześniejszą niż 1.2.2. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.2.2之前的版本的vis适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "vis",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "vis": "smaller(1.2.2)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the iqontrol adapter smaller than 0.2.12",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem iqontrol-Adapter, der kleiner als 0.2.12 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером iqontrol меньше 0.2.12",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador iqontrol menor que 0.2.12",
            "nl": "JS-Controller 2.x is niet compatibel met de iqontrol-adapter kleiner dan 0.2.12",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur iqontrol inférieur à 0.2.12",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore iqontrol più piccolo di 0.2.12.",
            "es": "JS-Controller 2.x no es compatible con el adaptador iqontrol más pequeño que 0.2.12",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem iqontrol mniejszym niż 0.2.12",
            "zh-cn": "JS-Controller 2.x与小于0.2.12的iqontrol适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the iqontrol adapter with a version prior to 0.2.12. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem iqontrol-Adapter mit einer Version vor 0.2.12 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером iqontrol с версией, предшествующей 0.2.12. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador iqontrol com uma versão anterior ao 0.2.12. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de iqontrol-adapter met een versie ouder dan 0.2.12. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur iqontrol avec une version antérieure à 0.2.12. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore iqontrol con una versione precedente a 0.2.12. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador iqontrol con una versión anterior a 0.2.12. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem iqontrol z wersją wcześniejszą niż 0.2.12. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与0.2.12之前的版本的iqontrol适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "iqontrol",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "iqontrol": "smaller(0.2.12)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the socketio adapter smaller than 2.1.2",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem socketio-Adapter, der kleiner als 2.1.2 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером socketio меньше 2.1.2",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador socketio menor que 2.1.2",
            "nl": "JS-Controller 2.x is niet compatibel met de socketio-adapter kleiner dan 2.1.2",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur socketio inférieur à 2.1.2",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore socketio più piccolo di 2.1.2.",
            "es": "JS-Controller 2.x no es compatible con el adaptador socketio más pequeño que 2.1.2",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem socketio mniejszym niż 2.1.2",
            "zh-cn": "JS-Controller 2.x与小于2.1.2的socketio适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the socketio adapter with a version prior to 2.1.2. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem socketio-Adapter mit einer Version vor 2.1.2 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером socketio с версией, предшествующей 2.1.2. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador socketio com uma versão anterior ao 2.1.2. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de socketio-adapter met een versie ouder dan 2.1.2. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur socketio avec une version antérieure à 2.1.2. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore socketio con una versione precedente a 2.1.2. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador socketio con una versión anterior a 2.1.2. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem socketio z wersją wcześniejszą niż 2.1.2. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与2.1.2之前的版本的socketio适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "socketio",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "socketio": "smaller(2.1.2)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the web adapter smaller than 2.4.9",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem web-Adapter, der kleiner als 2.4.9 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером web меньше 2.4.9",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador web menor que 2.4.9",
            "nl": "JS-Controller 2.x is niet compatibel met de web-adapter kleiner dan 2.4.9",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur web inférieur à 2.4.9",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore web più piccolo di 2.4.9.",
            "es": "JS-Controller 2.x no es compatible con el adaptador web más pequeño que 2.4.9",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem web mniejszym niż 2.4.9",
            "zh-cn": "JS-Controller 2.x与小于2.4.9的web适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the web adapter with a version prior to 2.4.9. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem web-Adapter mit einer Version vor 2.4.9 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером web с версией, предшествующей 2.4.9. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador web com uma versão anterior ao 2.4.9. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de web-adapter met een versie ouder dan 2.4.9. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur web avec une version antérieure à 2.4.9. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore web con una versione precedente a 2.4.9. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador web con una versión anterior a 2.4.9. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem web z wersją wcześniejszą niż 2.4.9. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与2.4.9之前的版本的web适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "web",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "web": "smaller(2.4.9)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the vis-hqwidgets adapter smaller than 1.1.3",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem vis-hqwidgets-Adapter, der kleiner als 1.1.3 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером vis-hqwidgets меньше 1.1.3",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador vis-hqwidgets menor que 1.1.3",
            "nl": "JS-Controller 2.x is niet compatibel met de vis-hqwidgets-adapter kleiner dan 1.1.3",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur vis-hqwidgets inférieur à 1.1.3",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore vis-hqwidgets più piccolo di 1.1.3.",
            "es": "JS-Controller 2.x no es compatible con el adaptador vis-hqwidgets más pequeño que 1.1.3",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem vis-hqwidgets mniejszym niż 1.1.3",
            "zh-cn": "JS-Controller 2.x与小于1.1.3的vis-hqwidgets适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the vis-hqwidgets adapter with a version prior to 1.1.3. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem vis-hqwidgets-Adapter mit einer Version vor 1.1.3 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером vis-hqwidgets с версией, предшествующей 1.1.3. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador vis-hqwidgets com uma versão anterior ao 1.1.3. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de vis-hqwidgets-adapter met een versie ouder dan 1.1.3. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur vis-hqwidgets avec une version antérieure à 1.1.3. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore vis-hqwidgets con una versione precedente a 1.1.3. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador vis-hqwidgets con una versión anterior a 1.1.3. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem vis-hqwidgets z wersją wcześniejszą niż 1.1.3. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与1.1.3之前的版本的vis-hqwidgets适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "vis-hqwidgets",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "vis-hqwidgets": "smaller(1.1.3)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the ble adapter smaller than 0.10.1",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem ble-Adapter, der kleiner als 0.10.1 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером ble меньше 0.10.1",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador ble menor que 0.10.1",
            "nl": "JS-Controller 2.x is niet compatibel met de ble-adapter kleiner dan 0.10.1",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur ble inférieur à 0.10.1",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore ble più piccolo di 0.10.1.",
            "es": "JS-Controller 2.x no es compatible con el adaptador ble más pequeño que 0.10.1",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem ble mniejszym niż 0.10.1",
            "zh-cn": "JS-Controller 2.x与小于0.10.1的ble适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the ble adapter with a version prior to 0.10.1. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem ble-Adapter mit einer Version vor 0.10.1 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером ble с версией, предшествующей 0.10.1. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador ble com uma versão anterior ao 0.10.1. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de ble-adapter met een versie ouder dan 0.10.1. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur ble avec une version antérieure à 0.10.1. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore ble con una versione precedente a 0.10.1. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador ble con una versión anterior a 0.10.1. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem ble z wersją wcześniejszą niż 0.10.1. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与0.10.1之前的版本的ble适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "ble",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-14T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "ble": "smaller(0.10.1)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the broadlink2 adapter smaller than 2.0.2",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem broadlink2-Adapter, der kleiner als 2.0.2 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером broadlink2 меньше 2.0.2",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador broadlink2 menor que 2.0.2",
            "nl": "JS-Controller 2.x is niet compatibel met de broadlink2-adapter kleiner dan 2.0.2",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur broadlink2 inférieur à 2.0.2",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore broadlink2 più piccolo di 2.0.2.",
            "es": "JS-Controller 2.x no es compatible con el adaptador broadlink2 más pequeño que 2.0.2",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem broadlink2 mniejszym niż 2.0.2",
            "zh-cn": "JS-Controller 2.x与小于2.0.2的broadlink2适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the broadlink2 adapter with a version prior to 2.0.2. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem broadlink2-Adapter mit einer Version vor 2.0.2 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером broadlink2 с версией, предшествующей 2.0.2. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador broadlink2 com uma versão anterior ao 2.0.2. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de broadlink2-adapter met een versie ouder dan 2.0.2. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur broadlink2 avec une version antérieure à 2.0.2. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore broadlink2 con una versione precedente a 2.0.2. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador broadlink2 con una versión anterior a 2.0.2. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem broadlink2 z wersją wcześniejszą niż 2.0.2. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与2.0.2之前的版本的broadlink2适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "broadlink2",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-15T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "broadlink2": "smaller(2.0.2)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 2.x is not compatible with the systeminfo adapter smaller than 0.3.1",
            "de": "JS-Controller 2.x ist nicht kompatibel mit dem systeminfo-Adapter, der kleiner als 0.3.1 ist",
            "ru": "JS-Controller 2.x несовместим с адаптером systeminfo меньше 0.3.1",
            "pt": "O JS-Controller 2.x não é compatível com o adaptador systeminfo menor que 0.3.1",
            "nl": "JS-Controller 2.x is niet compatibel met de systeminfo-adapter kleiner dan 0.3.1",
            "fr": "JS-Controller 2.x n'est pas compatible avec l'adaptateur systeminfo inférieur à 0.3.1",
            "it": "JS-Controller 2.x non è compatibile con l'adattatore systeminfo più piccolo di 0.3.1.",
            "es": "JS-Controller 2.x no es compatible con el adaptador systeminfo más pequeño que 0.3.1",
            "pl": "JS-Controller 2.x nie jest kompatybilny z adapterem systeminfo mniejszym niż 0.3.1",
            "zh-cn": "JS-Controller 2.x与小于0.3.1的systeminfo适配器不兼容"
        },
        "content": {
            "en": "The installed version of JS-Controller 2.x is not compatible with the systeminfo adapter with a version prior to 0.3.1. Please update the adapter to avoid problems.",
            "de": "Die installierte Version von JS-Controller 2.x ist nicht mit dem systeminfo-Adapter mit einer Version vor 0.3.1 kompatibel. Bitte aktualisieren Sie den Adapter, um Probleme zu vermeiden.",
            "ru": "Установленная версия JS-Controller 2.x несовместима с адаптером systeminfo с версией, предшествующей 0.3.1. Пожалуйста, обновите адаптер, чтобы избежать проблем.",
            "pt": "A versão instalada do JS-Controller 2.x não é compatível com o adaptador systeminfo com uma versão anterior ao 0.3.1. Atualize o adaptador para evitar problemas.",
            "nl": "De geïnstalleerde versie van JS-Controller 2.x is niet compatibel met de systeminfo-adapter met een versie ouder dan 0.3.1. Werk de adapter bij om problemen te voorkomen.",
            "fr": "La version installée de JS-Controller 2.x n'est pas compatible avec l'adaptateur systeminfo avec une version antérieure à 0.3.1. Veuillez mettre à jour l'adaptateur pour éviter les problèmes.",
            "it": "La versione installata di JS-Controller 2.x non è compatibile con l'adattatore systeminfo con una versione precedente a 0.3.1. Si prega di aggiornare l'adattatore per evitare problemi.",
            "es": "La versión instalada de JS-Controller 2.x no es compatible con el adaptador systeminfo con una versión anterior a 0.3.1. Actualice el adaptador para evitar problemas.",
            "pl": "Zainstalowana wersja JS-Controller 2.x nie jest kompatybilna z adapterem systeminfo z wersją wcześniejszą niż 0.3.1. Zaktualizuj adapter, aby uniknąć problemów.",
            "zh-cn": "JS-Controller 2.x的安装版本与0.3.1之前的版本的systeminfo适配器不兼容。请更新适配器以避免出现问题。"
        },
        "id": "systeminfo",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-11-15T00:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(2.0.0)",
            "systeminfo": "smaller(0.3.1)"
        }
    },
    {
        "title": {
            "en": "BREAKING CHANGE: No support for iPad 1+2/Android<4.4 with updates for web, socketio and admin!",
            "de": "BREAKING CHANGE: Keine Unterstützung für iPad 1+2/Android<4.4 mit Updates für Web, Socketio und Admin!",
            "ru": "BREAKING CHANGE: нет поддержки iPad 1+2/Android<4.4 с обновлениями для Интернета, socketio и admin!",
            "pt": "BREAKING CHANGE: Não há suporte para iPad 1+2/Android<4.4 com atualizações para web, socketio e admin!",
            "nl": "BREAKING CHANGE: Geen ondersteuning voor iPad 1+2/Android<4.4 met updates voor web, socketio en admin!",
            "fr": "CHANGEMENT DE RUPTURE: Pas de support pour iPad 1+2/Android<4.4 avec des mises à jour pour le web, socketio et admin!",
            "it": "CAMBIAMENTO DI ROTTURA: Nessun supporto per iPad 1+2/Android<4.4 con aggiornamenti per web, socketio e admin!",
            "es": "CAMBIO RÁPIDO: ¡No hay soporte para iPad 1+2/Android<4.4 con actualizaciones para web, socketio y admin!",
            "pl": "ZMIANA ZMIAN: Brak wsparcia dla iPada 1+2/Android<4.4 z aktualizacjami dla sieci, socketio i administratora!",
            "zh-cn": "突破性变化：不支持iPad 1+2/Android<4.4的Web，Socketio和Admin更新！"
        },
        "content": {
            "en": "The updates for web (3.0.x), socketio (3.0.x) and admin (4.0.x) do not support older devices like iPad 1+2/Android<4.4 anymore! Please DO NOT install the updates if you use such devices! More information and a list of adapters you need to update additional see the Community posts in Forum, Facebook and Teamspeak",
            "de": "Die Updates für Web (3.0.x), Socketio (3.0.x) und Admin (4.0.x) unterstützen ältere Geräte wie iPad 1 + 2 / Android <4.4 nicht mehr! Bitte installiere die Updates NICHT, wenn Du solche Geräte verwendest! Weitere Informationen und eine Liste der Adapter, die zusätzlich zu aktualisieren sind, finden Sie in den Community-Beiträgen in Forum, Facebook und Teamspeak",
            "ru": "Обновления для web (3.0.x), socketio (3.0.x) и admin (4.0.x) больше не поддерживают старые устройства, такие как iPad 1 + 2 / Android <4.4! Пожалуйста, НЕ устанавливайте обновления, если вы используете такие устройства! Дополнительную информацию и список адаптеров, которые необходимо обновить, смотрите в сообщениях сообщества на форумах, в Facebook и Teamspeak.",
            "pt": "As atualizações para web (3.0.x), socketio (3.0.x) e admin (4.0.x) não são mais compatíveis com dispositivos mais antigos como o iPad 1 + 2 / Android <4.4! NÃO instale as atualizações se você usar esses dispositivos! Para obter mais informações e uma lista de adaptadores que você precisa atualizar, consulte as postagens da comunidade em Fórum, Facebook e Teamspeak",
            "nl": "De updates voor web (3.0.x), socketio (3.0.x) en admin (4.0.x) ondersteunen geen oudere apparaten zoals iPad 1 + 2 / Android <4.4 meer! Installeer de updates NIET als u dergelijke apparaten gebruikt! Meer informatie en een lijst met adapters die je nodig hebt om extra bij te werken, zie de Community-berichten in Forum, Facebook en Teamspeak",
            "fr": "Les mises à jour pour le Web (3.0.x), socketio (3.0.x) et admin (4.0.x) ne prennent plus en charge les appareils plus anciens comme iPad 1 + 2 / Android <4.4! Veuillez NE PAS installer les mises à jour si vous utilisez de tels appareils! Plus d'informations et une liste d'adaptateurs dont vous avez besoin de mettre à jour supplémentaires voir les messages de la communauté dans Forum, Facebook et Teamspeak",
            "it": "Gli aggiornamenti per web (3.0.x), socketio (3.0.x) e admin (4.0.x) non supportano più i dispositivi più vecchi come iPad 1 + 2 / Android <4.4! Si prega di NON installare gli aggiornamenti se si utilizzano tali dispositivi! Maggiori informazioni e un elenco di adattatori che è necessario aggiornare ulteriormente vedere i post della community in Forum, Facebook e Teamspeak",
            "es": "¡Las actualizaciones para web (3.0.x), socketio (3.0.x) y admin (4.0.x) ya no son compatibles con dispositivos más antiguos como iPad 1 + 2 / Android <4.4! ¡NO instale las actualizaciones si utiliza dichos dispositivos! Para obtener más información y una lista de adaptadores que necesita actualizar, consulte las publicaciones de la comunidad en Forum, Facebook y Teamspeak.",
            "pl": "Aktualizacje dla sieci (3.0.x), socketio (3.0.x) i admin (4.0.x) nie obsługują już starszych urządzeń takich jak iPad 1 + 2 / Android <4.4! NIE instaluj aktualizacji, jeśli korzystasz z takich urządzeń! Więcej informacji i lista adapterów, które musisz zaktualizować, zobacz posty społeczności na forum, Facebooku i Teamspeak",
            "zh-cn": "Web（3.0.x），socketio（3.0.x）和admin（4.0.x）的更新不再支持iPad 1 + 2 / Android <4.4之类的旧设备！如果您使用此类设备，请不要安装更新！有关其他信息的更多信息和适配器列表，请参阅论坛，Facebook和Teamspeak中的社区帖子。"
        },
        "id": "socketio-update-web-admin-socketio-stable",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2020-05-03T01:00:00.000Z",
        "conditions": {
            "admin": "smaller(4.0.0)",
            "web": "smaller(3.0.0)",
            "socketio": "smaller(3.0.0)"
        }
    },
    {
        "title": {
            "en": "Mydlink: Object IDs will change",
            "de": "Mydlink: Objekt-IDs ändern sich",
            "ru": "Mydlink: Идентификаторы объектов будут меняться",
            "pt": "Mydlink: os IDs de objetos serão alterados",
            "nl": "Mydlink: Object-ID's zullen veranderen",
            "fr": "Mydlink: les ID d'objet vont changer",
            "it": "Mydlink: gli ID oggetto cambieranno",
            "es": "Mydlink: las ID de objeto cambiarán",
            "pl": "Mydlink: identyfikatory obiektów ulegną zmianie",
            "zh-cn": "Mydlink：对象ID将更改"
        },
        "content": {
            "en": "Breaking change: With this update the device ids will change from 'Name' to 'MAC'. That means 'mydlink..Name.state' will be reachable at 'mydlink..MAC.state' after the update. The transition should be automatic. If not, please have a look in instance configuration (the new auto detect functionality should make configuration much easier). This change was necessary to make IDs static and unique, two requirements the name does not offer.",
            "de": "Aktuelle Änderung: Mit diesem Update ändern sich die Geräte-IDs von \"Name\" in \"MAC\". Das bedeutet, dass 'mydlink..Name.state' nach dem Update unter 'mydlink..MAC.state' erreichbar ist. Der Übergang sollte automatisch erfolgen. Wenn nicht, schauen Sie sich bitte die Instanzkonfiguration an (die neue Funktion zur automatischen Erkennung sollte die Konfiguration erheblich vereinfachen). Diese Änderung war erforderlich, um IDs statisch und eindeutig zu machen, zwei Anforderungen, die der Name nicht bietet.",
            "ru": "Срочные изменения: с этим обновлением идентификаторы устройств изменятся с «Имя» на «MAC». Это означает, что «mydlink..Name.state» будет доступно в «mydlink..MAC.state» после обновления. Переход должен быть автоматическим. Если нет, пожалуйста, посмотрите на конфигурацию экземпляра (новая функция автоопределения должна значительно упростить настройку). Это изменение было необходимо, чтобы сделать идентификаторы статичными и уникальными, два требования, которые имя не предлагает.",
            "pt": "Alterações recentes: com esta atualização, os IDs do dispositivo mudarão de 'Nome' para 'MAC'. Isso significa que 'mydlink..Name.state' estará acessível em 'mydlink..MAC.state' após a atualização. A transição deve ser automática. Caso contrário, consulte a configuração da instância (a nova funcionalidade de detecção automática deve facilitar muito a configuração). Essa alteração foi necessária para tornar os IDs estáticos e exclusivos, dois requisitos que o nome não oferece.",
            "nl": "Brekende wijziging: met deze update veranderen de apparaat-ID's van 'Naam' in 'MAC'. Dat betekent dat 'mydlink..Name.state' na de update bereikbaar zal zijn op 'mydlink..MAC.state'. De overgang moet automatisch zijn. Zo niet, neem dan een kijkje in de configuratie van de instantie (de nieuwe functie voor automatisch detecteren zou de configuratie veel gemakkelijker moeten maken). Deze wijziging was nodig om ID's statisch en uniek te maken, twee vereisten die de naam niet biedt.",
            "fr": "Changement de rupture: Avec cette mise à jour, les identifiants des appareils passeront de «Nom» à «MAC». Cela signifie que «mydlink..Name.state» sera accessible sur «mydlink..MAC.state» après la mise à jour. La transition doit être automatique. Sinon, veuillez jeter un œil à la configuration de l'instance (la nouvelle fonctionnalité de détection automatique devrait faciliter la configuration). Cette modification était nécessaire pour rendre les identifiants statiques et uniques, deux exigences que le nom n'offre pas.",
            "it": "Ultime modifiche: con questo aggiornamento gli ID dei dispositivi cambieranno da \"Nome\" a \"MAC\". Ciò significa che \"mydlink..Name.state\" sarà raggiungibile in \"mydlink..MAC.state\" dopo l'aggiornamento. La transizione dovrebbe essere automatica. In caso contrario, dai un'occhiata alla configurazione dell'istanza (la nuova funzionalità di rilevamento automatico dovrebbe rendere la configurazione molto più semplice). Questa modifica è stata necessaria per rendere gli ID statici e univoci, due requisiti che il nome non offre.",
            "es": "Cambio de última hora: con esta actualización, los ID del dispositivo cambiarán de 'Nombre' a 'MAC'. Eso significa que 'mydlink..Name.state' estará disponible en 'mydlink..MAC.state' después de la actualización. La transición debe ser automática. De lo contrario, eche un vistazo a la configuración de la instancia (la nueva funcionalidad de detección automática debería facilitar la configuración). Este cambio fue necesario para que los ID fueran estáticos y únicos, dos requisitos que el nombre no ofrece.",
            "pl": "Przełomowa zmiana: dzięki tej aktualizacji identyfikatory urządzeń zmienią się z „Nazwa” na „MAC”. Oznacza to, że „mydlink..Name.state” będzie dostępny w „mydlink..MAC.state” po aktualizacji. Przejście powinno być automatyczne. Jeśli nie, zajrzyj do konfiguracji instancji (nowa funkcja automatycznego wykrywania powinna znacznie ułatwić konfigurację). Ta zmiana była konieczna, aby identyfikatory były statyczne i niepowtarzalne, dwa wymagania, których nazwa nie oferuje.",
            "zh-cn": "重大更改：通过此更新，设备ID将由“名称”更改为“ MAC”。这意味着更新后，可以在“ mydlink.MAC.state”处访问“ mydlink..Name.state”。过渡应该是自动的。如果没有，请查看实例配置（新的自动检测功能将使配置更加容易）。进行此更改对于使ID静态且唯一是必要的，这是名称未提供的两个要求。"
        },
        "id": "mydlinkAdapter",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-02T00:00:00.000Z",
        "repo": "latest",
        "conditions": {
            "mydlink": "smaller(1.0.0)"
        }
    },
    {
        "title": {
            "en": "deconz: Important! Delete adapter before update",
            "de": "deconz: Wichtig! Adapter vor dem Update löschen",
            "ru": "deconz: Важно! Удалить адаптер перед обновлением",
            "pt": "deconz: Importante! Excluir adaptador antes da atualização",
            "nl": "deconz: Belangrijk! Verwijder adapter voor update",
            "fr": "deconz: Important! Supprimer l'adaptateur avant la mise à jour",
            "it": "deconz: Importante! Elimina l'adattatore prima dell'aggiornamento",
            "es": "deconz: ¡Importante! Eliminar adaptador antes de actualizar",
            "pl": "deconz: Ważne! Usuń adapter przed aktualizacją",
            "zh-cn": "deconz：重要！更新前删除适配器"
        },
        "content": {
            "en": "To prevent issues save your API Key and delete the adapter than install new, espacially if you com from a version <1.3.x. The minimum js-controller version must be 2.2.9 and nodejs 10.",
            "de": "Um Probleme zu vermeiden, speichern Sie Ihren API-Schlüssel und löschen Sie den Adapter, bevor Sie ihn neu installieren, insbesondere wenn Sie von einer Version <1.3.x kommen. Die minimale js-controller-Version muss 2.2.9 und nodejs 10 sein.",
            "ru": "Во избежание проблем сохраните ваш ключ API и удалите адаптер, а не устанавливайте новый, особенно если вы используете версию с версией <1.3.x. Минимальная версия js-контроллера должна быть 2.2.9, а nodejs 10.",
            "pt": "Para evitar problemas, salve sua chave API e exclua o adaptador e instale novo, espacialmente, se você vier de uma versão <1.3.x. A versão mínima do controlador js deve ser 2.2.9 e nodejs 10.",
            "nl": "Om problemen te voorkomen, slaat u uw API-sleutel op en verwijdert u de adapter en installeert u deze nieuw, vooral als u een versie <1.3.x gebruikt. De minimale js-controller-versie moet 2.2.9 en nodejs 10 zijn.",
            "fr": "Pour éviter les problèmes, enregistrez votre clé API et supprimez l'adaptateur plutôt que d'installer un nouveau, surtout si vous utilisez une version <1.3.x. La version minimale du contrôleur js doit être 2.2.9 et nodejs 10.",
            "it": "Per evitare problemi, salva la tua chiave API ed elimina l'adattatore anziché installarne di nuovi, soprattutto se hai una versione <1.3.x. La versione minima del controller js deve essere 2.2.9 e nodejs 10.",
            "es": "Para evitar problemas, guarde su clave API y elimine el adaptador que instale nuevo, espacialmente si viene de una versión <1.3.x. La versión mínima del controlador js debe ser 2.2.9 y nodejs 10.",
            "pl": "Aby uniknąć problemów, zapisz klucz API i usuń adapter niż zainstaluj nowy, szczególnie jeśli korzystasz z wersji <1.3.x. Minimalna wersja kontrolera js musi wynosić 2.2.9 i nodejs 10.",
            "zh-cn": "为防止出现问题，请保存API密钥并删除适配器，然后再安装新适配器，尤其是如果您使用的是<1.3.x版本的com。最低js-controller版本必须为2.2.9和nodejs 10。"
        },
        "id": "deconzAdapter",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-07T00:00:00.000Z",
        "conditions": {
            "deconz": "smaller(1.3.0)"
        }
    },
    {
        "title": {
            "en": "UniFi: Important delete adapter before update",
            "de": "UniFi: Wichtiger Adapter vor dem Update löschen",
            "ru": "UniFi: важно удалить адаптер перед обновлением",
            "pt": "UniFi: Importante excluir adaptador antes da atualização",
            "nl": "UniFi: belangrijke verwijderingsadapter voor update",
            "fr": "UniFi: suppression importante de l'adaptateur avant la mise à jour",
            "it": "UniFi: importante adattatore di cancellazione prima dell'aggiornamento",
            "es": "UniFi: adaptador de eliminación importante antes de la actualización",
            "pl": "UniFi: Ważne usuń adapter przed aktualizacją",
            "zh-cn": "UniFi：重要的是在更新之前删除适配器"
        },
        "content": {
            "en": "Starting with v0.5.0 the object structure changes. Besides that less information will be pulled into your ioBroker. To start with a clean object structure, please delete the adapter before updating to v0.5.0.",
            "de": "Ab Version 0.5.0 ändert sich die Objektstruktur. Außerdem werden weniger Informationen in Ihren ioBroker gezogen. Um mit einer sauberen Objektstruktur zu beginnen, löschen Sie bitte den Adapter, bevor Sie auf v0.5.0 aktualisieren.",
            "ru": "Начиная с v0.5.0 структура объекта меняется. Кроме того, в ваш ioBroker будет потрачено меньше информации. Для начала с чистой структурой объекта, пожалуйста, удалите адаптер перед обновлением до v0.5.0.",
            "pt": "A partir da v0.5.0, a estrutura do objeto é alterada. Além disso, menos informações serão inseridas no seu ioBroker. Para começar com uma estrutura de objeto limpa, exclua o adaptador antes de atualizar para a v0.5.0.",
            "nl": "Vanaf v0.5.0 verandert de objectstructuur. Daarnaast wordt er minder informatie naar uw ioBroker getrokken. Om te beginnen met een schone objectstructuur, moet u de adapter verwijderen voordat u bijwerkt naar v0.5.0.",
            "fr": "À partir de la version 0.5.0, la structure de l'objet change. En plus de cela, moins d'informations seront rassemblées dans votre ioBroker. Pour commencer avec une structure d'objet propre, veuillez supprimer l'adaptateur avant de mettre à jour vers la version 0.5.0.",
            "it": "A partire dalla v0.5.0 la struttura dell'oggetto cambia. Inoltre, nel tuo ioBroker verranno inserite meno informazioni. Per iniziare con una struttura di oggetti pulita, eliminare l'adattatore prima di aggiornare a v0.5.0.",
            "es": "A partir de v0.5.0, la estructura del objeto cambia. Además de eso, se extraerá menos información en su ioBroker. Para comenzar con una estructura de objetos limpia, elimine el adaptador antes de actualizar a v0.5.0.",
            "pl": "Począwszy od wersji 0.5.0 zmienia się struktura obiektu. Poza tym do Twojego ioBroker zostanie pobranych mniej informacji. Aby rozpocząć od czystej struktury obiektu, usuń adapter przed aktualizacją do wersji 0.5.0.",
            "zh-cn": "从v0.5.0开始，对象结构发生变化。除此之外，更少的信息将被拉到您的ioBroker中。要从干净的对象结构开始，请先删除适配器，然后再更新到v0.5.0。"
        },
        "id": "unifiAdapter",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-09T00:00:00.000Z",
        "conditions": {
            "unifi": "smaller(0.5.0)"
        }
    },
    {
        "title": {
            "en": "Pushover 1.2.x does not work with JS controller 3.x.",
            "de": "Pushover 1.2.x funktioniert nicht mit JS Controller 3.x.",
            "ru": "Pushover 1.2.x не работает с контроллером JS 3.x.",
            "pt": "O Pushover 1.2.x não funciona com o controlador JS 3.x.",
            "nl": "Pushover 1.2.x werkt niet met JS-controller 3.x.",
            "fr": "Pushover 1.2.x ne fonctionne pas avec le contrôleur JS 3.x.",
            "it": "Pushover 1.2.x non funziona con il controller JS 3.x.",
            "es": "Pushover 1.2.x no funciona con el controlador JS 3.x.",
            "pl": "Pushover 1.2.x nie działa z kontrolerem JS 3.x.",
            "zh-cn": "Pushover 1.2.x不适用于JS控制器3.x。"
        },
        "content": {
            "en": "Pushover works in version 1.1.x. If you have version 1.2.x on it could get problems and should please install versions from 1.3.0, there the problems are solved.",
            "de": "Pushover funktioniert in Version 1.1.x. Wenn Sie Version 1.2.x haben, kann es zu Problemen kommen und sollten Sie bitte Versionen ab 1.3.0 installieren, dort sind die Probleme behoben.",
            "ru": "Pushover работает в версии 1.1.x. Если у вас есть версия 1.2.x, на ней могут возникнуть проблемы, и, пожалуйста, установите версии с 1.3.0, там проблемы решены.",
            "pt": "O pushover funciona na versão 1.1.x. Se você possui a versão 1.2.x, pode haver problemas e deve instalar as versões da 1.3.0, aí os problemas foram resolvidos.",
            "nl": "Pushover werkt in versie 1.1.x. Als je versie 1.2.x hebt, kan het problemen krijgen en moet je versies vanaf 1.3.0 installeren, daar zijn de problemen opgelost.",
            "fr": "Pushover fonctionne dans la version 1.1.x. Si vous avez la version 1.2.x sur elle pourrait avoir des problèmes et si vous devez installer des versions à partir de 1.3.0, les problèmes sont résolus.",
            "it": "Pushover funziona nella versione 1.1.x. Se hai la versione 1.2.x su potrebbe avere problemi e dovresti installare versioni dalla 1.3.0, lì i problemi sono risolti.",
            "es": "Pushover funciona en la versión 1.1.x. Si tiene la versión 1.2.x, podría tener problemas y debería instalar las versiones de 1.3.0, allí se resuelven los problemas.",
            "pl": "Pushover działa w wersji 1.1.x. Jeśli masz wersję 1.2.x, może to powodować problemy i należy zainstalować wersje od 1.3.0, tam problemy zostały rozwiązane.",
            "zh-cn": "Pushover适用于1.1.x版。如果您使用的是1.2.x版，则可能会出现问题，请安装1.3.0版以上的版本，即可解决问题。"
        },
        "id": "pushoverAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(3.0.0)",
            "pushover": "between(1.2.0,1.2.9)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 3.x only supports TR-064 adapters from 4.0.0",
            "de": "JS-Controller 3.x unterstützt nur TR-064-Adapter ab 4.0.0",
            "ru": "JS-Controller 3.x поддерживает только адаптеры TR-064 начиная с 4.0.0",
            "pt": "O JS-Controller 3.x suporta apenas adaptadores TR-064 da 4.0.0",
            "nl": "JS-Controller 3.x ondersteunt alleen TR-064-adapters vanaf 4.0.0",
            "fr": "JS-Controller 3.x ne prend en charge que les adaptateurs TR-064 à partir de 4.0.0",
            "it": "JS-Controller 3.x supporta solo adattatori TR-064 dalla 4.0.0",
            "es": "JS-Controller 3.x solo admite adaptadores TR-064 de 4.0.0",
            "pl": "JS-Controller 3.x obsługuje tylko adaptery TR-064 od 4.0.0",
            "zh-cn": "JS-Controller 3.x仅支持4.0.0以上的TR-064适配器"
        },
        "content": {
            "en": "Please install the current version of the TR-064 adapter, because your version does not run under JS-Controller 3.x.",
            "de": "Bitte installieren Sie die aktuelle Version des TR-064-Adapters, da Ihre Version nicht unter JS-Controller 3.x ausgeführt wird.",
            "ru": "Пожалуйста, установите текущую версию адаптера TR-064, потому что ваша версия не работает под JS-Controller 3.x.",
            "pt": "Instale a versão atual do adaptador TR-064, porque sua versão não é executada no JS-Controller 3.x.",
            "nl": "Installeer a.u.b. de huidige versie van de TR-064 adapter, omdat uw versie niet draait onder JS-Controller 3.x.",
            "fr": "Veuillez installer la version actuelle de l'adaptateur TR-064, car votre version ne fonctionne pas sous JS-Controller 3.x.",
            "it": "Installa la versione corrente dell'adattatore TR-064, perché la tua versione non funziona con JS-Controller 3.x.",
            "es": "Instale la versión actual del adaptador TR-064, ya que su versión no se ejecuta en JS-Controller 3.x.",
            "pl": "Zainstaluj aktualną wersję adaptera TR-064, ponieważ twoja wersja nie działa pod JS-Controller 3.x.",
            "zh-cn": "请安装当前版本的TR-064适配器，因为您的版本不在JS-Controller 3.x下运行。"
        },
        "id": "tr-064AdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(3.0.0)",
            "tr-064": "smaller(4.0.0)"
        }
    },
    {
        "title": {
            "en": "TR-064 Community Version is no longer being developed",
            "de": "Die Community-Version TR-064 wird nicht mehr entwickelt",
            "ru": "Версия сообщества TR-064 больше не разрабатывается",
            "pt": "A versão da comunidade TR-064 não está mais sendo desenvolvida",
            "nl": "TR-064 Community-versie wordt niet meer ontwikkeld",
            "fr": "La version communautaire TR-064 n'est plus en cours de développement",
            "it": "La versione della comunità TR-064 non è più in fase di sviluppo",
            "es": "La versión de comunidad TR-064 ya no se está desarrollando",
            "pl": "Wersja społecznościowa TR-064 nie jest już rozwijana",
            "zh-cn": "不再开发TR-064社区版本"
        },
        "content": {
            "en": "The community version of the tr-064 adapter is no longer maintained. Please install the normal tr-064 from version 4.0.0.",
            "de": "Die Community-Version des tr-064-Adapters wird nicht mehr gepflegt. Bitte installieren Sie den normalen tr-064 ab Version 4.0.0.",
            "ru": "Общественная версия адаптера tr-064 больше не поддерживается. Пожалуйста, установите нормальный TR-064 от версии 4.0.0.",
            "pt": "A versão da comunidade do adaptador tr-064 não é mais mantida. Por favor, instale o tr-064 normal da versão 4.0.0.",
            "nl": "De communityversie van de tr-064-adapter wordt niet langer onderhouden. Installeer de normale tr-064 vanaf versie 4.0.0.",
            "fr": "La version communautaire de l'adaptateur tr-064 n'est plus maintenue. Veuillez installer le tr-064 normal à partir de la version 4.0.0.",
            "it": "La versione della comunità dell'adattatore tr-064 non viene più mantenuta. Installa il normale tr-064 dalla versione 4.0.0.",
            "es": "La versión de comunidad del adaptador tr-064 ya no se mantiene. Instale el tr-064 normal de la versión 4.0.0.",
            "pl": "Wersja społecznościowa adaptera tr-064 nie jest już obsługiwana. Zainstaluj normalny tr-064 z wersji 4.0.0.",
            "zh-cn": "tr-064适配器的社区版本不再维护。请从版本4.0.0安装标准tr-064。"
        },
        "id": "tr-064-communityAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "tr-064-community": "installed",
            "tr-064": "!installed"
        }
    },
    {
        "title": {
            "en": "JS-Controller 3.x only supports firetv adapters from 1.0.0",
            "de": "JS-Controller 3.x unterstützt nur Firetv-Adapter ab 1.0.0",
            "ru": "JS-Controller 3.x поддерживает только Firetv адаптеры с 1.0.0",
            "pt": "O JS-Controller 3.x suporta apenas adaptadores firetv da 1.0.0",
            "nl": "JS-Controller 3.x ondersteunt alleen firetv-adapters vanaf 1.0.0",
            "fr": "JS-Controller 3.x ne prend en charge que les adaptateurs firetv à partir de 1.0.0",
            "it": "JS-Controller 3.x supporta solo adattatori firetv dalla 1.0.0",
            "es": "JS-Controller 3.x solo admite adaptadores firetv de 1.0.0",
            "pl": "JS-Controller 3.x obsługuje tylko adaptery firetv od 1.0.0",
            "zh-cn": "JS-Controller 3.x仅支持1.0.0以上的firetv适配器"
        },
        "content": {
            "en": "Please install the current version of the firetv adapter, because your version does not run under JS-Controller 3.x.",
            "de": "Bitte installieren Sie die aktuelle Version des Firetv-Adapters, da Ihre Version nicht unter JS-Controller 3.x ausgeführt wird.",
            "ru": "Пожалуйста, установите текущую версию адаптера firetv, потому что ваша версия не работает под JS-Controller 3.x.",
            "pt": "Instale a versão atual do adaptador firetv, porque sua versão não é executada no JS-Controller 3.x.",
            "nl": "Installeer de huidige versie van de firetv-adapter, omdat uw versie niet werkt onder JS-Controller 3.x.",
            "fr": "Veuillez installer la version actuelle de l'adaptateur firetv, car votre version ne fonctionne pas sous JS-Controller 3.x.",
            "it": "Installa la versione corrente dell'adattatore firetv, perché la tua versione non funziona con JS-Controller 3.x.",
            "es": "Instale la versión actual del adaptador firetv, porque su versión no se ejecuta en JS-Controller 3.x.",
            "pl": "Zainstaluj aktualną wersję adaptera firetv, ponieważ twoja wersja nie działa pod JS-Controller 3.x.",
            "zh-cn": "请安装firetv适配器的当前版本，因为您的版本未在JS-Controller 3.x下运行。"
        },
        "id": "firetvAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(3.0.0)",
            "firetv": "smaller(1.0.0)"
        }
    },
    {
        "title": {
            "en": "JS-Controller 3.x only supports wifilight adapters from 1.1.0",
            "de": "JS-Controller 3.x unterstützt nur Wifilight-Adapter ab 1.1.0",
            "ru": "JS-Controller 3.x поддерживает только адаптеры wifilight начиная с версии 1.1.0",
            "pt": "O JS-Controller 3.x suporta apenas adaptadores wifilight a partir da 1.1.0",
            "nl": "JS-Controller 3.x ondersteunt alleen wifilight-adapters vanaf 1.1.0",
            "fr": "JS-Controller 3.x ne prend en charge que les adaptateurs wifilight de la version 1.1.0",
            "it": "JS-Controller 3.x supporta solo adattatori wifilight da 1.1.0",
            "es": "JS-Controller 3.x solo admite adaptadores wifilight de 1.1.0",
            "pl": "JS-Controller 3.x obsługuje tylko adaptery wifilight od 1.1.0",
            "zh-cn": "JS-Controller 3.x仅支持1.1.0起的wifilight适配器"
        },
        "content": {
            "en": "Please install the current version of the wifilight adapter, because your version does not run under JS-Controller 3.x.",
            "de": "Bitte installieren Sie die aktuelle Version des Wifilight-Adapters, da Ihre Version nicht unter JS-Controller 3.x ausgeführt wird.",
            "ru": "Пожалуйста, установите текущую версию адаптера wifilight, потому что ваша версия не работает под JS-Controller 3.x.",
            "pt": "Instale a versão atual do adaptador wifilight, porque sua versão não é executada no JS-Controller 3.x.",
            "nl": "Installeer de huidige versie van de wifilight-adapter, omdat uw versie niet werkt onder JS-Controller 3.x.",
            "fr": "Veuillez installer la version actuelle de l'adaptateur wifilight, car votre version ne fonctionne pas sous JS-Controller 3.x.",
            "it": "Installa la versione corrente dell'adattatore wifilight, perché la tua versione non funziona con JS-Controller 3.x.",
            "es": "Instale la versión actual del adaptador wifilight, porque su versión no se ejecuta bajo JS-Controller 3.x.",
            "pl": "Zainstaluj aktualną wersję adaptera wifilight, ponieważ twoja wersja nie działa pod JS-Controller 3.x.",
            "zh-cn": "请安装wifilight适配器的当前版本，因为您的版本未在JS-Controller 3.x下运行。"
        },
        "id": "wifilightAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "js-controller": "bigger(3.0.0)",
            "wifilight": "smaller(1.1.0)"
        }
    },
    {
        "title": {
            "en": "The Firetv Adapter Community Version is no longer being developed",
            "de": "Die Firetv Adapter Community-Version wird nicht mehr entwickelt",
            "ru": "Версия сообщества Firetv Adapter больше не разрабатывается",
            "pt": "A versão da comunidade do adaptador Firetv não está mais sendo desenvolvida",
            "nl": "De Firetv Adapter Community-versie wordt niet langer ontwikkeld",
            "fr": "La version communautaire de l'adaptateur Firetv n'est plus en cours de développement",
            "it": "La versione comunitaria dell'adattatore Firetv non è più in fase di sviluppo",
            "es": "La versión de la comunidad del adaptador Firetv ya no se está desarrollando",
            "pl": "Wersja społeczności Firetv Adapter nie jest już rozwijana",
            "zh-cn": "Firetv适配器社区版本已不再开发"
        },
        "content": {
            "en": "The community version of the firetv adapter is no longer maintained. Please install the normal firetv from version 1.0.0.",
            "de": "Die Community-Version des Firetv-Adapters wird nicht mehr gepflegt. Bitte installieren Sie das normale Firetv ab Version 1.0.0.",
            "ru": "Общественная версия адаптера firetv больше не поддерживается. Пожалуйста, установите обычный firetv с версии 1.0.0.",
            "pt": "A versão da comunidade do adaptador firetv não é mais mantida. Por favor, instale o firetv normal da versão 1.0.0.",
            "nl": "De communityversie van de firetv-adapter wordt niet langer onderhouden. Installeer de normale firetv vanaf versie 1.0.0.",
            "fr": "La version communautaire de l'adaptateur firetv n'est plus maintenue. Veuillez installer le firetv normal à partir de la version 1.0.0.",
            "it": "La versione della comunità dell'adattatore firetv non viene più mantenuta. Installa il normale firetv dalla versione 1.0.0.",
            "es": "La versión comunitaria del adaptador firetv ya no se mantiene. Instale el firetv normal de la versión 1.0.0.",
            "pl": "Wersja społecznościowa adaptera firetv nie jest już obsługiwana. Zainstaluj normalną firetv od wersji 1.0.0.",
            "zh-cn": "firetv适配器的社区版本不再维护。请从1.0.0版开始安装普通的firetv。"
        },
        "id": "firetv-communityAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "firetv-community": "installed",
            "firetv": "!installed"
        }
    },
    {
        "title": {
            "en": "The Wifilight Adapter Community Version is no longer being developed",
            "de": "Die Wifilight Adapter Community-Version wird nicht mehr entwickelt",
            "ru": "Версия сообщества адаптеров Wifilight больше не разрабатывается",
            "pt": "A versão da comunidade do adaptador Wifilight não está mais sendo desenvolvida",
            "nl": "De Wifilight Adapter Community-versie wordt niet langer ontwikkeld",
            "fr": "La version communautaire de l'adaptateur Wifilight n'est plus en cours de développement",
            "it": "La versione comunitaria dell'adattatore Wifilight non è più in fase di sviluppo",
            "es": "La versión de la comunidad del adaptador Wifilight ya no se está desarrollando",
            "pl": "Wersja społecznościowa adaptera Wifilight nie jest już rozwijana",
            "zh-cn": "不再开发Wifilight Adapter社区版本"
        },
        "content": {
            "en": "The community version of the Wifilight adapter is no longer maintained. Please install the normal Wifilight from version 1.1.0.",
            "de": "Die Community-Version des Wifilight-Adapters wird nicht mehr verwaltet. Bitte installieren Sie das normale Wifilight ab Version 1.1.0.",
            "ru": "Общественная версия адаптера Wifilight больше не поддерживается. Пожалуйста, установите нормальный Wifilight с версии 1.1.0.",
            "pt": "A versão da comunidade do adaptador Wifilight não é mais mantida. Por favor, instale o Wifilight normal da versão 1.1.0.",
            "nl": "De communityversie van de Wifilight-adapter wordt niet langer onderhouden. Installeer de normale Wifilight vanaf versie 1.1.0.",
            "fr": "La version communautaire de l'adaptateur Wifilight n'est plus maintenue. Veuillez installer le Wifilight normal à partir de la version 1.1.0.",
            "it": "La versione della comunità dell'adattatore Wifilight non è più mantenuta. Installa Wifilight normale dalla versione 1.1.0.",
            "es": "La versión comunitaria del adaptador Wifilight ya no se mantiene. Instale el Wifilight normal de la versión 1.1.0.",
            "pl": "Wersja społecznościowa adaptera Wifilight nie jest już obsługiwana. Zainstaluj normalny Wifilight z wersji 1.1.0.",
            "zh-cn": "Wifilight适配器的社区版本不再维护。请从1.1.0版开始安装普通的Wifilight。"
        },
        "id": "wifilight-communityAdapterStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "wifilight-community": "installed",
            "wifilight": "!installed"
        }
    },
    {
        "title": {
            "en": "Lightify platform will be shut down on August 31, 2021.",
            "de": "Die Lightify-Plattform wird am 31. August 2021 heruntergefahren.",
            "ru": "Платформа Lightify будет закрыта 31 августа 2021 года.",
            "pt": "A plataforma Lightify será encerrada em 31 de agosto de 2021.",
            "nl": "Het Lightify-platform wordt op 31 augustus 2021 gesloten.",
            "fr": "La plateforme Lightify sera fermée le 31 août 2021.",
            "it": "La piattaforma Lightify verrà chiusa il 31 agosto 2021.",
            "es": "La plataforma Lightify se cerrará el 31 de agosto de 2021.",
            "pl": "Platforma Lightify zostanie zamknięta 31 sierpnia 2021 r.",
            "zh-cn": "Lightify平台将于2021年8月31日关闭。"
        },
        "content": {
            "en": "The Lightify adapter will no longer work as of JS controller 3.x. However, since Lightify will no longer be used as a platform in a few months, we have decided not to put any more effort into it. It is best to connect the devices directly using the Zigbee or Dekonz adapter.",
            "de": "Der Lightify-Adapter funktioniert ab JS-Controller 3.x nicht mehr. Da Lightify jedoch in einigen Monaten nicht mehr als Plattform verwendet wird, haben wir beschlossen, keine weiteren Anstrengungen zu unternehmen. Am besten schließen Sie die Geräte direkt mit dem ZigBee- oder Dekonz-Adapter an.",
            "ru": "Адаптер Lightify больше не будет работать с контроллером JS 3.x. Однако, поскольку Lightify больше не будет использоваться в качестве платформы через несколько месяцев, мы решили не прилагать к этому больше усилий. Лучше всего подключать устройства напрямую, используя адаптер Zigbee или Dekonz.",
            "pt": "O adaptador Lightify não funcionará mais a partir do controlador JS 3.x. No entanto, como o Lightify não será mais usado como plataforma em alguns meses, decidimos não colocar mais esforços nela. É melhor conectar os dispositivos diretamente usando o adaptador Zigbee ou Dekonz.",
            "nl": "De Lightify-adapter werkt niet meer vanaf JS-controller 3.x. Omdat Lightify over een paar maanden niet meer als platform zal worden gebruikt, hebben we besloten er geen moeite meer voor te doen. De apparaten sluit je best direct aan met de Zigbee of Dekonz adapter.",
            "fr": "L'adaptateur Lightify ne fonctionnera plus à partir du contrôleur JS 3.x. Cependant, comme Lightify ne sera plus utilisé comme plate-forme dans quelques mois, nous avons décidé de ne plus y faire d'efforts. Il est préférable de connecter les appareils directement à l'aide de l'adaptateur Zigbee ou Dekonz.",
            "it": "L'adattatore Lightify non funzionerà più dal controller JS 3.x. Tuttavia, poiché Lightify non verrà più utilizzato come piattaforma tra qualche mese, abbiamo deciso di non impegnarci ulteriormente. È meglio collegare i dispositivi direttamente utilizzando l'adattatore Zigbee o Dekonz.",
            "es": "El adaptador Lightify ya no funcionará a partir del controlador JS 3.x. Sin embargo, dado que Lightify ya no se usará como plataforma en unos pocos meses, hemos decidido no poner más esfuerzo en ello. Es mejor conectar los dispositivos directamente usando el adaptador Zigbee o Dekonz.",
            "pl": "Adapter Lightify nie będzie już działał z kontrolerem JS 3.x. Ponieważ jednak Lightify nie będzie już używane jako platforma za kilka miesięcy, postanowiliśmy nie wkładać w to więcej wysiłku. Najlepiej jest podłączyć urządzenia bezpośrednio za pomocą adaptera Zigbee lub Dekonz.",
            "zh-cn": "从JS控制器3.x开始，Lightify适配器将不再起作用。但是，由于Lightify将在几个月后不再用作平台，因此我们决定不付出更多努力。最好使用Zigbee或Dekonz适配器直接连接设备。"
        },
        "id": "lightifyAdapter",
        "class": "info",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-11T00:00:00.000Z",
        "conditions": {
            "lightify": "installed"
        }
    },
    {
        "title": {
            "en": "Node.JS versions smaller than 10 will be soon deprecated",
            "de": "Node.JS-Versionen, die kleiner als 10 sind, werden bald nicht mehr unterstützt",
            "ru": "Версии Node.JS, меньшие 10, скоро будут устаревшими",
            "pt": "Versões do Node.JS menores que 10 serão descontinuadas em breve",
            "nl": "Node.JS-versies kleiner dan 10 worden binnenkort verouderd",
            "fr": "Les versions de Node.JS inférieures à 10 seront bientôt obsolètes",
            "it": "Le versioni di Node.JS inferiori a 10 saranno presto deprecate",
            "es": "Las versiones de Node.JS más pequeñas que 10 pronto serán desaprobadas",
            "pl": "Wersje Node.JS mniejsze niż 10 zostaną wkrótce wycofane",
            "zh-cn": "小于8的Node.JS版本将很快被弃用"
        },
        "content": {
            "en": "With the upcoming version 3 of the JS-controller, the support of Node.JS versions smaller than 10.x.x will be discontinued. Please update your system to a higher version. We recommend the Node.JS version 12.x.x.",
            "de": "Mit der kommenden Version 3 des JS-Controllers wird die Unterstützung von Node.JS-Versionen kleiner als 10.x.x eingestellt. Bitte aktualisieren Sie Ihr System auf eine höhere Version. Wir empfehlen die Node.JS-Version 12.x.x.",
            "ru": "С выходом второй версии JS-контроллера поддержка версий Node.JS, меньших 10.x.x, будет прекращена. Пожалуйста, обновите вашу систему до более поздней версии. Мы рекомендуем Node.JS версии 12.x.x.",
            "pt": "Com a próxima versão 3 do controlador JS, o suporte às versões do Node.JS menores que 10.x.x será descontinuado. Atualize seu sistema para uma versão superior. Recomendamos a versão 12.x.x do Node.JS.",
            "nl": "Met de komende versie 3 van de JS-controller wordt de ondersteuning van Node.JS-versies kleiner dan 10.x.x stopgezet. Werk uw systeem bij naar een hogere versie. We raden de Node.JS-versie 12.x.x aan.",
            "fr": "Avec la prochaine version 3 du contrôleur JS, le support des versions de Node.JS inférieures à 10.x.x sera supprimé. Veuillez mettre à jour votre système avec une version supérieure. Nous recommandons la version 12.x.x de Node.JS.",
            "it": "Con la prossima versione 3 del controller JS, il supporto delle versioni Node.JS inferiori a 10.x.x verrà sospeso. Si prega di aggiornare il sistema a una versione successiva. Consigliamo Node.JS versione 12.x.x.",
            "es": "Con la próxima versión 3 del controlador JS, se suspenderá el soporte de las versiones Node.JS más pequeñas que 10.x.x. Actualice su sistema a una versión superior. Recomendamos el Node.JS versión 12.x.x.",
            "pl": "W nadchodzącej wersji 3 kontrolera JS obsługa Node.JS w wersji mniejszej niż 10.x.x zostanie przerwana. Zaktualizuj system do wyższej wersji. Zalecamy wersję 12.x.x. Node.JS",
            "zh-cn": "随着即将发布的JS-controller版本3，将不再支持小于10.x.x的Node.JS版本。请更新您的系统到更高版本。我们建议使用Node.JS版本12.x.x。"
        },
        "id": "js-controller",
        "node-version": "smaller(10.0.0)",
        "class": "info",
        "fa-icon": "ban",
        "created": "2020-05-29T19:00:00.000Z",
        "conditions": {
            "admin": "bigger(3.6.10)"
        }
    },
    {
        "title": {
            "en": "New JS-Controller 3.1 is available!",
            "de": "Neuer JS-Controller 3.1 ist verfügbar!",
            "ru": "Доступен новый JS-Controller 3.1!",
            "pt": "O novo JS-Controller 3.1 está disponível!",
            "nl": "Nieuwe JS-Controller 3.1 is beschikbaar!",
            "fr": "Le nouveau JS-Controller 3.1 est disponible!",
            "it": "Nuovo JS-Controller 3.1 è disponibile!",
            "es": "¡Nuevo JS-Controller 3.1 está disponible!",
            "pl": "Nowy JS-Controller 3.1 jest dostępny!",
            "zh-cn": "新的JS-Controller 3.1可用了！"
        },
        "content": {
            "en": "An upgrade for the js-controller is available for your system. This version of the js-controller is compatible with your Node.js version. On installation the new Error/Crash reporting (Sentry) will be activated. Please check the informations displayed during upgrade. More details about this release con be found at https://forum.iobroker.net/post/441350",
            "de": "Ein Upgrade für den js-Controller ist für Ihr System verfügbar. Diese Version des js-Controllers ist mit Ihrer Node.js-Version kompatibel. Bei der Installation wird die neue Fehler- / Absturzmeldung (Sentry) aktiviert. Bitte überprüfen Sie die während des Upgrades angezeigten Informationen. Weitere Informationen zu dieser Version finden Sie unter https://forum.iobroker.net/post/441350",
            "ru": "Для вашей системы доступно обновление для js-контроллера. Эта версия js-контроллера совместима с вашей версией Node.js. При установке будет активирован новый отчет об ошибках / сбоях (Sentry). Пожалуйста, проверьте информацию, отображаемую во время обновления. Более подробную информацию об этом выпуске можно найти по адресу https://forum.iobroker.net/post/441350.",
            "pt": "Uma atualização para o controlador js está disponível para o seu sistema. Esta versão do controlador js é compatível com a sua versão do Node.js. Na instalação, o novo relatório de Erro / Crash (Sentry) será ativado. Por favor, verifique as informações exibidas durante a atualização. Mais detalhes sobre esta versão podem ser encontrados em https://forum.iobroker.net/post/441350",
            "nl": "Er is een upgrade voor de js-controller beschikbaar voor uw systeem. Deze versie van de js-controller is compatibel met uw Node.js-versie. Bij installatie wordt de nieuwe fout- / crashrapportage (Sentry) geactiveerd. Controleer de informatie die wordt weergegeven tijdens de upgrade. Meer informatie over deze release vindt u op https://forum.iobroker.net/post/441350",
            "fr": "Une mise à niveau pour le contrôleur js est disponible pour votre système. Cette version du contrôleur js est compatible avec votre version Node.js. Lors de l'installation, le nouveau rapport d'erreur / crash (Sentry) sera activé. Veuillez vérifier les informations affichées lors de la mise à niveau. Plus de détails sur cette version peuvent être trouvés sur https://forum.iobroker.net/post/441350",
            "it": "Un aggiornamento per il controller js è disponibile per il tuo sistema. Questa versione del controller js è compatibile con la tua versione Node.js. Al momento dell'installazione verrà attivato il nuovo rapporto Errore / Arresto (Sentry). Si prega di controllare le informazioni visualizzate durante l'aggiornamento. Maggiori dettagli su questa versione sono disponibili all'indirizzo https://forum.iobroker.net/post/441350",
            "es": "Una actualización para el controlador js está disponible para su sistema. Esta versión del controlador js es compatible con su versión Node.js. En la instalación, se activará el nuevo informe de error / bloqueo (Centinela). Compruebe la información que se muestra durante la actualización. Puede encontrar más detalles sobre esta versión en https://forum.iobroker.net/post/441350",
            "pl": "Uaktualnienie dla kontrolera js jest dostępne dla twojego systemu. Ta wersja kontrolera js jest kompatybilna z twoją wersją Node.js. Podczas instalacji zostanie aktywowane nowe raportowanie błędów / awarii (Sentry). Sprawdź informacje wyświetlane podczas aktualizacji. Więcej informacji na temat tego wydania można znaleźć na https://forum.iobroker.net/post/441350",
            "zh-cn": "您的系统可以使用js-controller的升级。此版本的js-controller与您的Node.js版本兼容。在安装时，新的错误/崩溃报告（Sentry）将被激活。请检查升级过程中显示的信息。有关此发行版的更多详细信息，请参见https://forum.iobroker.net/post/441350"
        },
        "id": "jscontroller-3-latest-nodejs10Stable",
        "class": "info",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T18:55:00.000Z",
        "node-version": "bigger(10.0.0)",
        "conditions": {
            "js-controller": "smaller(3.1.4)"
        }
    },
    {
        "title": {
            "en": "New JS-Controller 3.1 is available!",
            "de": "Neuer JS-Controller 3.1 ist verfügbar!",
            "ru": "Доступен новый JS-Controller 3.1!",
            "pt": "O novo JS-Controller 3.1 está disponível!",
            "nl": "Nieuwe JS-Controller 3.1 is beschikbaar!",
            "fr": "Le nouveau JS-Controller 3.1 est disponible!",
            "it": "Nuovo JS-Controller 3.1 è disponibile!",
            "es": "¡Nuevo JS-Controller 3.1 está disponible!",
            "pl": "Nowy JS-Controller 3.1 jest dostępny!",
            "zh-cn": "新的JS-Controller 3.1可用了！"
        },
        "content": {
            "en": "An upgrade for the js-controller is available for your system. You need to upgrade Node.js before installing the update (Instructions: https://forum.iobroker.net/post/266625)!! On installation the new Error/Crash reporting (Sentry) will be activated. Please check the informations displayed during upgrade. More details about this release and the needed Node.js upgrade can be found at https://forum.iobroker.net/post/441350",
            "de": "Ein Upgrade für den js-Controller ist für Ihr System verfügbar. Sie müssen Node.js aktualisieren, bevor Sie das Update installieren (Anleitung: https://forum.iobroker.net/post/266625) !! Bei der Installation wird die neue Fehler- / Absturzmeldung (Sentry) aktiviert. Bitte überprüfen Sie die während des Upgrades angezeigten Informationen. Weitere Details zu dieser Version und dem erforderlichen Node.js-Upgrade finden Sie unter https://forum.iobroker.net/post/441350",
            "ru": "Для вашей системы доступно обновление для js-контроллера. Вам необходимо обновить Node.js перед установкой обновления (инструкции: https://forum.iobroker.net/post/266625) !! При установке будет активирован новый отчет об ошибках / сбоях (Sentry). Пожалуйста, проверьте информацию, отображаемую во время обновления. Более подробную информацию об этом выпуске и необходимом обновлении Node.js можно найти по адресу https://forum.iobroker.net/post/441350.",
            "pt": "Uma atualização para o controlador js está disponível para o seu sistema. Você precisa atualizar o Node.js antes de instalar a atualização (instruções: https://forum.iobroker.net/post/266625) !! Na instalação, o novo relatório de Erro / Crash (Sentry) será ativado. Por favor, verifique as informações exibidas durante a atualização. Mais detalhes sobre esta versão e a atualização necessária do Node.js. podem ser encontrados em https://forum.iobroker.net/post/441350",
            "nl": "Er is een upgrade voor de js-controller beschikbaar voor uw systeem. Je moet Node.js upgraden voordat je de update installeert (Instructies: https://forum.iobroker.net/post/266625) !! Bij installatie wordt de nieuwe fout- / crashrapportage (Sentry) geactiveerd. Controleer de informatie die wordt weergegeven tijdens de upgrade. Meer informatie over deze release en de benodigde Node.js-upgrade is te vinden op https://forum.iobroker.net/post/441350",
            "fr": "Une mise à niveau pour le contrôleur js est disponible pour votre système. Vous devez mettre à jour Node.js avant d'installer la mise à jour (Instructions: https://forum.iobroker.net/post/266625) !! Lors de l'installation, le nouveau rapport d'erreur / crash (Sentry) sera activé. Veuillez vérifier les informations affichées lors de la mise à niveau. Plus de détails sur cette version et la mise à niveau Node.js nécessaire peuvent être trouvés à https://forum.iobroker.net/post/441350",
            "it": "Un aggiornamento per il controller js è disponibile per il tuo sistema. È necessario aggiornare Node.js prima di installare l'aggiornamento (Istruzioni: https://forum.iobroker.net/post/266625) !! Al momento dell'installazione verrà attivato il nuovo rapporto Errore / Arresto (Sentry). Si prega di controllare le informazioni visualizzate durante l'aggiornamento. Maggiori dettagli su questa versione e sull'aggiornamento Node.js necessario sono disponibili su https://forum.iobroker.net/post/441350",
            "es": "Una actualización para el controlador js está disponible para su sistema. ¡¡Necesita actualizar Node.js antes de instalar la actualización (Instrucciones: https://forum.iobroker.net/post/266625) !! En la instalación, se activará el nuevo informe de error / bloqueo (Centinela). Compruebe la información que se muestra durante la actualización. Puede encontrar más detalles sobre esta versión y la actualización necesaria de Node.js en https://forum.iobroker.net/post/441350",
            "pl": "Uaktualnienie dla kontrolera js jest dostępne dla twojego systemu. Musisz zaktualizować Node.js przed zainstalowaniem aktualizacji (instrukcje: https://forum.iobroker.net/post/266625) !! Podczas instalacji zostanie aktywowane nowe raportowanie błędów / awarii (Sentry). Sprawdź informacje wyświetlane podczas aktualizacji. Więcej informacji na temat tej wersji i wymaganej aktualizacji Node.js można znaleźć na stronie https://forum.iobroker.net/post/441350",
            "zh-cn": "您的系统可以使用js-controller的升级。您需要在安装更新之前升级Node.js（说明：https://forum.iobroker.net/post/266625）！在安装时，新的错误/崩溃报告（Sentry）将被激活。请检查升级过程中显示的信息。有关此版本和所需的Node.js升级的更多详细信息，请参见https://forum.iobroker.net/post/441350"
        },
        "id": "jscontroller-3-latest-nodejssmaller10Stable",
        "class": "info",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-29T18:55:00.000Z",
        "node-version": "smaller(10.0.0)",
        "conditions": {
            "js-controller": "smaller(3.1.4)"
        }
    },
    {
        "title": {
            "en": "tr-064 Adapter v4.x requires you to enter your password anew",
            "de": "Für den tr-064 Adapter v4.x müssen Sie Ihr Kennwort erneut eingeben",
            "ru": "tr-064 Adapter v4.x требует от вас заново ввести пароль",
            "pt": "O adaptador tr-064 v4.x requer que você digite sua senha novamente",
            "nl": "tr-064 Adapter v4.x vereist dat u uw wachtwoord opnieuw invoert",
            "fr": "L'adaptateur tr-064 v4.x vous oblige à saisir à nouveau votre mot de passe",
            "it": "L'adattatore v4.x di tr-064 richiede di inserire nuovamente la password",
            "es": "El adaptador tr-064 v4.x requiere que ingrese su contraseña nuevamente",
            "pl": "Adapter tr-064 v4.x wymaga ponownego wprowadzenia hasła",
            "zh-cn": "tr-064适配器v4.x要求您重新输入密码"
        },
        "content": {
            "en": "You use the tr-064 adapter. When you update to v4.x best stop the adapter before and enter the passwort anew in the adapter configuration before you start the adater again. Please also check the logfile afterwards.",
            "de": "Sie verwenden den Adapter tr-064. Wenn Sie auf v4.x aktualisieren, stoppen Sie den Adapter am besten vorher und geben Sie das Kennwort erneut in die Adapterkonfiguration ein, bevor Sie den Adater erneut starten. Bitte überprüfen Sie auch die Protokolldatei danach.",
            "ru": "Вы используете адаптер tr-064. При обновлении до v4.x лучше всего остановить адаптер и ввести заново пароль в конфигурацию адаптера, прежде чем снова запустить адатор. Пожалуйста, проверьте файл журнала позже.",
            "pt": "Você usa o adaptador tr-064. Quando você atualiza para a v4.x, é melhor parar o adaptador antes e inserir a senha novamente na configuração do adaptador antes de iniciar o adater novamente. Por favor, verifique o arquivo de log depois.",
            "nl": "Je gebruikt de tr-064 adapter. Wanneer u bijwerkt naar v4.x, stop dan eerst de adapter en voer het wachtwoord opnieuw in de adapterconfiguratie in voordat u de adater opnieuw start. Controleer ook het logbestand achteraf.",
            "fr": "Vous utilisez l'adaptateur tr-064. Lorsque vous effectuez une mise à jour vers v4.x, arrêtez l'adaptateur avant et entrez à nouveau le mot de passe dans la configuration de l'adaptateur avant de redémarrer l'adaptateur. Veuillez également vérifier le fichier journal par la suite.",
            "it": "Si utilizza l'adattatore tr-064. Quando si aggiorna a v4.x, arrestare prima l'adattatore e immettere nuovamente il passwort nella configurazione dell'adattatore prima di riavviare l'adater. Successivamente, controlla anche il file di registro.",
            "es": "Utiliza el adaptador tr-064. Cuando actualice a v4.x, detenga el adaptador antes e ingrese el passwort nuevamente en la configuración del adaptador antes de volver a iniciar el adaptador. Por favor, compruebe también el archivo de registro después.",
            "pl": "Używasz adaptera tr-064. W przypadku aktualizacji do wersji 4.x najlepiej zatrzymać adapter wcześniej i wprowadzić ponownie hasło w konfiguracji adaptera przed ponownym uruchomieniem adatera. Sprawdź również plik dziennika później.",
            "zh-cn": "您使用tr-064适配器。当您更新到v4.x时，最好先停止适配器，然后在适配器配置中重新输入密码，然后再重新启动适配器。请随后再检查日志文件。"
        },
        "id": "tr-064AdapterPasswordReenter",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-16T00:00:00.000Z",
        "conditions": {
            "tr-064": "smaller(4.0.0)"
        }
    },
    {
        "title": {
            "en": "Pushover Adapter v2.x requires you to enter your token anew",
            "de": "Für den Pushover-Adapter v2.x müssen Sie Ihr Token erneut eingeben",
            "ru": "Pushover Adapter v2.x требует от вас заново ввести токен",
            "pt": "O Pushover Adapter v2.x exige que você insira seu token novamente",
            "nl": "Pushover Adapter v2.x vereist dat u uw token opnieuw invoert",
            "fr": "L'adaptateur Pushover v2.x vous oblige à saisir à nouveau votre jeton",
            "it": "Pushover Adapter v2.x richiede di inserire nuovamente il token",
            "es": "Pushover Adapter v2.x requiere que ingreses tu token nuevamente",
            "pl": "Adapter Pushover v2.x wymaga ponownego wprowadzenia tokena",
            "zh-cn": "Pushover Adapter v2.x要求您重新输入令牌"
        },
        "content": {
            "en": "You use the Pushover adapter. When you update to v2.x best stop the adapter before and enter the token anew in the adapter configuration before you start the adater again. Please also check the logfile afterwards.",
            "de": "Sie verwenden den Pushover-Adapter. Wenn Sie auf v2.x aktualisieren, stoppen Sie den Adapter am besten vorher und geben Sie das Token erneut in die Adapterkonfiguration ein, bevor Sie den Adater erneut starten. Bitte überprüfen Sie auch die Protokolldatei danach.",
            "ru": "Вы используете адаптер Pushover. При обновлении до v2.x лучше всего сначала остановить адаптер и заново ввести токен в конфигурацию адаптера, прежде чем снова запустить адатер. Пожалуйста, проверьте файл журнала позже.",
            "pt": "Você usa o adaptador Pushover. Quando você atualiza para a v2.x, é melhor parar o adaptador antes e inserir o token novamente na configuração do adaptador antes de iniciar o adater novamente. Por favor, verifique o arquivo de log depois.",
            "nl": "Je gebruikt de Pushover adapter. Wanneer u bijwerkt naar v2.x, stop dan eerst de adapter en voer het token opnieuw in de adapterconfiguratie in voordat u de adater opnieuw start. Controleer ook het logbestand achteraf.",
            "fr": "Vous utilisez l'adaptateur Pushover. Lorsque vous effectuez une mise à jour vers v2.x, arrêtez l'adaptateur avant et entrez à nouveau le jeton dans la configuration de l'adaptateur avant de redémarrer l'adaptateur. Veuillez également vérifier le fichier journal par la suite.",
            "it": "Si utilizza l'adattatore Pushover. Quando si aggiorna a v2.x, arrestare meglio l'adattatore prima e immettere nuovamente il token nella configurazione dell'adattatore prima di riavviare l'adater. Successivamente, controlla anche il file di registro.",
            "es": "Utiliza el adaptador Pushover. Cuando actualice a v2.x, detenga el adaptador antes e ingrese el token nuevamente en la configuración del adaptador antes de volver a iniciar el adaptador. Por favor, compruebe también el archivo de registro después.",
            "pl": "Używasz adaptera Pushover. W przypadku aktualizacji do wersji 2.x najlepiej zatrzymać adapter wcześniej i wprowadzić token na nowo w konfiguracji adaptera przed ponownym uruchomieniem adatera. Sprawdź również plik dziennika później.",
            "zh-cn": "您使用Pushover适配器。当您更新到v2.x时，最好先停止适配器，然后在适配器配置中重新输入令牌，然后再次启动适配器。请随后再检查日志文件。"
        },
        "id": "PushoverAdapterPasswordReenter",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-16T00:00:00.000Z",
        "conditions": {
            "pushover": "smaller(2.0.0)"
        }
    },
    {
        "title": {
            "en": "Important information for Javascript adapter update to 4.6.x",
            "de": "Wichtige Informationen für das Javascript-Adapter-Update auf 4.6.x.",
            "ru": "Важная информация для обновления адаптера Javascript до 4.6.x",
            "pt": "Informações importantes para a atualização do adaptador Javascript para 4.6.x",
            "nl": "Belangrijke informatie voor het updaten van de Javascript-adapter naar 4.6.x",
            "fr": "Informations importantes pour la mise à jour de l'adaptateur Javascript vers 4.6.x",
            "it": "Informazioni importanti per l'aggiornamento dell'adattatore Javascript alla 4.6.x",
            "es": "Información importante para la actualización del adaptador Javascript a 4.6.x",
            "pl": "Ważne informacje dotyczące aktualizacji adaptera JavaScript do wersji 4.6.x",
            "zh-cn": "Javascript适配器更新到4.6.x的重要信息"
        },
        "content": {
            "en": "BREAKING: Please check \"stopTimeout\" blocks in your Blockly scripts that the correct timeout name is listed after the update! Please check this BEFORE updating to the new version or export the affected single scripts as XML and re-import after the update!",
            "de": "BREAKING: Bitte überprüfen Sie \"stopTimeout\" -Blöcke in Ihren Blockly-Skripten, ob der richtige Timeout-Name nach dem Update aufgeführt ist! Bitte überprüfen Sie dies, BEVOR Sie auf die neue Version aktualisieren oder exportieren Sie die betroffenen Einzelskripte als XML und importieren Sie sie nach dem Update erneut!",
            "ru": "BREAKING: Пожалуйста, проверьте блоки \"stopTimeout\" в ваших скриптах Blockly, чтобы после обновления отображалось правильное имя тайм-аута! Пожалуйста, проверьте это перед обновлением до новой версии или экспортируйте отдельные уязвимые скрипты в формате XML и повторно импортируйте после обновления!",
            "pt": "BREAKING: verifique nos blocos \"stopTimeout\" nos scripts do Blockly que o nome do tempo limite correto está listado após a atualização! Por favor, verifique isso ANTES de atualizar para a nova versão ou exporte os scripts únicos afetados como XML e reimporte após a atualização!",
            "nl": "BREAKING: Controleer de \"stopTimeout\" -blokken in uw Blockly-scripts dat de juiste time-outnaam wordt vermeld na de update! Controleer dit VOORDAT u bijwerkt naar de nieuwe versie of exporteer de betrokken afzonderlijke scripts als XML en importeer opnieuw na de update!",
            "fr": "RUPTURE: Veuillez vérifier les blocs \"stopTimeout\" dans vos scripts Blockly que le nom de timeout correct est répertorié après la mise à jour! Veuillez vérifier ceci AVANT la mise à jour vers la nouvelle version ou exporter les scripts uniques concernés en XML et réimporter après la mise à jour!",
            "it": "BREAKING: Controlla i blocchi \"stopTimeout\" negli script Blockly che il nome di timeout corretto sia elencato dopo l'aggiornamento! Controlla questo PRIMA dell'aggiornamento alla nuova versione o esporta i singoli script interessati come XML e reimportali dopo l'aggiornamento!",
            "es": "ROMPIENDO: Por favor, compruebe los bloques \"stopTimeout\" en sus scripts Blockly que el nombre de tiempo de espera correcto aparece después de la actualización ¡Compruebe esto ANTES de actualizar a la nueva versión o exporte los scripts individuales afectados como XML y vuelva a importar después de la actualización!",
            "pl": "ŁAMANIE: Sprawdź skrypty „stopTimeout” w swoich skryptach Blockly, czy poprawna nazwa limitu czasu jest podana po aktualizacji! Proszę to sprawdzić PRZED aktualizacją do nowej wersji lub wyeksportować dotknięte nim pojedyncze skrypty jako XML i ponownie zaimportować po aktualizacji!",
            "zh-cn": "BREAKING：请检查您的Blockly脚本中的“ stopTimeout”块，以确保更新后列出了正确的超时名称！请在更新到新版本之前进行检查，或将受影响的单个脚本导出为XML，并在更新后重新导入！"
        },
        "id": "JsAdapterBlocklyStable",
        "class": "warning",
        "fa-icon": "exclamation-circle",
        "created": "2020-05-28T02:00:00.000Z",
        "conditions": {
            "javascript": "smaller(4.6.0)"
        }
    }
]
