[
    {
        "title": {
            "en": "** ATTENTION ** defective versions of the Tankerkönig adapter cause massive problems on the server!",
            "de": "** ACHTUNG ** Defekte Versionen des Tankerkönig-Adapters verursachen massive Probleme auf dem Server!",
            "ru": "** ВНИМАНИЕ ** Дефектные версии адаптера Tankerkönig вызывают серьезные проблемы на сервере!",
            "pt": "** ATENÇÃO ** versões defeituosas do adaptador Tankerkönig causam enormes problemas no servidor!",
            "nl": "** LET OP ** Defecte versies van de Tankerkönig-adapter veroorzaken enorme problemen op de server!",
            "fr": "** ATTENTION ** les versions défectueuses de l'adaptateur Tankerkönig causent de gros problèmes sur le serveur!",
            "it": "** ATTENZIONE ** le versioni difettose dell'adattatore Tankerkönig causano enormi problemi sul server!",
            "es": "** ATENCIÓN ** las versiones defectuosas del adaptador Tankerkönig causan problemas masivos en el servidor!",
            "pl": "** UWAGA ** wadliwe wersje adaptera Tankerkönig powodują ogromne problemy na serwerze!",
            "zh-cn": "**注意**Tankerkönig适配器的有缺陷版本会导致服务器出现大量问题！"
        },
        "content": {
            "en": "We have been repeatedly reminded by the Tankerkönig-Team that users with one of the defective versions between 1.0.5 and 2.0.4, are blocking their servers.<br>Please install only versions before 1.0.5 or after 2.0.4.",
            "de": "Wir wurden wiederholt vom Tankerkönig-Team daran erinnert, dass Benutzer mit einer der fehlerhaften Versionen zwischen 1.0.5 und 2.0.4 ihre Server blockieren.<br>Bitte installieren Sie nur Versionen vor 1.0.5 oder nach 2.0.4.",
            "ru": "Команда Tankerkönig-Team неоднократно напоминала нам, что пользователи с одной из дефектных версий между 1.0.5 и 2.0.4 блокируют свои серверы. <br> Пожалуйста, устанавливайте только версии до 1.0.5 или после 2.0.4.",
            "pt": "Temos sido repetidamente lembrados pelo Tankerkönig-Team que os usuários com uma das versões defeituosas entre 1.0.5 e 2.0.4, estão bloqueando seus servidores.<br>Por favor, instale apenas versões anteriores a 1.0.5 ou posteriores à 2.0.4.",
            "nl": "We hebben het Tankerkönig-team herhaaldelijk herinnerd aan het feit dat gebruikers met een van de defecte versies tussen 1.0.5 en 2.0.4 hun servers blokkeren.<br>Installeer alstublieft alleen versies vóór 1.0.5 of na 2.0.4.",
            "fr": "L'équipe Tankerkönig nous a rappelé à plusieurs reprises que les utilisateurs qui utilisent l'une des versions défectueuses entre 1.0.5 et 2.0.4 bloquent leurs serveurs.<br>Veuillez installer uniquement les versions antérieures à 1.0.5 ou ultérieure.",
            "it": "Ci è stato ripetutamente ricordato dal Team Tankerkönig che gli utenti con una delle versioni difettose tra 1.0.5 e 2.0.4 stanno bloccando i loro server.<br>Si prega di installare solo versioni precedenti alla 1.0.5 o successive alla 2.0.4.",
            "es": "El equipo de Tankerkönig nos ha recordado repetidamente que los usuarios con una de las versiones defectuosas entre 1.0.5 y 2.0.4 están bloqueando sus servidores.<br>Instale solo las versiones anteriores a 1.0.5 o posteriores a 2.0.4.",
            "pl": "Zespół Tankerkönig wielokrotnie przypominał, że użytkownicy z jedną z wadliwych wersji między 1.0.5 a 2.0.4 blokują swoje serwery. <br> Zainstaluj tylko wersje przed 1.0.5 lub po 2.0.4.",
            "zh-cn": "Tankerkönig-Team一再提醒我们，有一个1.0.5和2.0.4之间缺陷版本的用户正在阻止他们的服务器。<br>请仅安装1.0.5之前或2.0.4之后的版本。"
        },
        "id": "tanker",
        "created": "2019-02-24T00:00:00.000Z",
        "class": "danger",
        "fa-icon": "bolt",
        "conditions": {
            "tankerkoenig": "smaller(2.0.5)"
        }
    },
    {
        "title": {
            "en": "Broadlink not maintained anymore",
            "de": "Broadlink wird nicht mehr gepflegt",
            "ru": "Broadlink больше не поддерживается",
            "pt": "O Broadlink não é mais mantido",
            "nl": "Broadlink niet meer onderhouden",
            "fr": "Broadlink n'est plus maintenu",
            "it": "Broadlink non mantenuto più",
            "es": "Broadlink no se mantiene más",
            "pl": "Broadlink nie jest już obsługiwany",
            "zh-cn": "Broadlink不再维护了"
        },
        "content": {
            "en": "This project is no longer maintained for personal reasons. Please use the ioBroker.broadlink2 instead.",
            "de": "Dieses Projekt wird aus persönlichen Gründen nicht mehr gepflegt. Bitte verwenden Sie stattdessen den ioBroker.broadlink2.",
            "ru": "Этот проект больше не поддерживается по личным причинам. Пожалуйста, используйте вместо этого ioBroker.broadlink2.",
            "pt": "Este projeto não é mais mantido por motivos pessoais. Por favor, use o ioBroker.broadlink2 em seu lugar.",
            "nl": "Dit project wordt om persoonlijke redenen niet langer onderhouden. Gebruik in plaats daarvan de ioBroker.broadlink2.",
            "fr": "Ce projet n'est plus maintenu pour des raisons personnelles. Veuillez utiliser le ioBroker.broadlink2 à la place.",
            "it": "Questo progetto non è più mantenuto per ragioni personali. Utilizzare invece ioBroker.broadlink2.",
            "es": "Este proyecto ya no se mantiene por razones personales. Por favor use el ioBroker.broadlink2 en su lugar.",
            "pl": "Ten projekt nie jest już utrzymywany z powodów osobistych. Zamiast tego użyj pliku ioBroker.broadlink2.",
            "zh-cn": "由于个人原因，该项目不再维护。请改用ioBroker.broadlink2。"
        },
        "id": "broadlink",
        "created": "2019-03-13T00:00:00.000Z",
        "conditions": {
            "broadlink": "installed",
            "broadlink2": "!installed"
        }
    },
    {
        "title": {
            "en": "Info Adapter Version 1.2.4 causes problems with the VIS Editor",
            "de": "Info Adapter Version 1.2.4 verursacht Probleme beim VIS Editor",
            "ru": "Info Adapter версии 1.2.4 вызывает проблемы с VIS Editor",
            "pt": "Adaptador de Info Versão 1.2.4 causa problemas com o VIS Editor",
            "nl": "Info Adapter Versie 1.2.4 veroorzaakt problemen met de VIS Editor",
            "fr": "Info Adapter version 1.2.4 provoque des problèmes avec l'éditeur de vis",
            "it": "Info Adapter Versione 1.2.4 causa problemi con l'editor VIS",
            "es": "La versión 1.2.4 del adaptador de información causa problemas con el editor VIS",
            "pl": "Info Adapter Version 1.2.4 powoduje problemy z edytorem VIS",
            "zh-cn": "信息适配器版本1.2.4导致VIS编辑器出现问题"
        },
        "content": {
            "en": "The problem with the VIS editor has been fixed since version 1.2.5. Please install the new version.",
            "de": "Das Problem mit dem VIS-Editor wurde mit der Version 1.2.5 behoben. ",
            "ru": "Проблема с редактором VIS была исправлена ​​с версии 1.2.5. ",
            "pt": "O problema com o editor VIS foi corrigido desde a versão 1.2.5. ",
            "nl": "Het probleem met de VIS-editor is verholpen sinds versie 1.2.5. ",
            "fr": "Le problème avec l'éditeur VIS a été corrigé depuis la version 1.2.5. ",
            "it": "Il problema con l'editor VIS è stato risolto dalla versione 1.2.5. ",
            "es": "El problema con el editor VIS se ha solucionado desde la versión 1.2.5. ",
            "pl": "Problem z edytorem VIS został naprawiony od wersji 1.2.5. ",
            "zh-cn": "自版本1.2.5起，VIS编辑器的问题已得到修复。"
        },
        "id": "infoAdapter",
        "created": "2019-03-15T00:00:00.000Z",
        "conditions": {
            "info": "equals(1.2.4)"
        }
    },
    {
        "title": {
            "en": "Adapter 'Radar' will not be further developed!",
            "de": "Radar wird nicht weiterentwickelt!",
            "ru": "Адаптер 'Radar' больше не будет развиваться!",
            "pt": "O Adaptador 'Radar' não será mais desenvolvido!",
            "nl": "Adapter 'Radar' wordt niet verder ontwikkeld!",
            "fr": "L'adaptateur 'Radar' ne sera plus développé!",
            "it": "L'adattatore 'Radar' non sarà ulteriormente sviluppato!",
            "es": "¡El adaptador 'Radar' no se desarrollará más!",
            "pl": "Adapter 'Radar' nie będzie dalej rozwijany!",
            "zh-cn": "适配器'Radar'将不再进一步开发！"
        },
        "content": {
            "en": "Due to the development of the ioBroker.radar2 adapter, the further development of the ioBroker.radar adapter has been discontinued. Please install the new adapter to get more features.",
            "de": "Aufgrund der Entwicklung des ioBroker.radar2 Adapters, wurde die Weiterentwicklung des ioBroker.radar-Adapters eingestellt. Bitte installieren Sie den neuen Adapter um weitere Funktionen zu bekommen.",
            "ru": "В связи с разработкой адаптера ioBroker.radar2 дальнейшая разработка адаптера ioBroker.radar была прекращена. Пожалуйста, установите новый адаптер, чтобы получить больше возможностей.",
            "pt": "Devido ao desenvolvimento do adaptador ioBroker.radar2, o desenvolvimento adicional do adaptador ioBroker.radar foi descontinuado. Por favor, instale o novo adaptador para obter mais recursos.",
            "nl": "Vanwege de ontwikkeling van de ioBroker.radar2-adapter is de verdere ontwikkeling van de ioBroker.radar-adapter stopgezet. Installeer de nieuwe adapter om meer functies te krijgen.",
            "fr": "En raison du développement de l'adaptateur ioBroker.radar2, le développement de l'adaptateur ioBroker.radar a été arrêté. Veuillez installer le nouvel adaptateur pour obtenir plus de fonctionnalités.",
            "it": "A causa dello sviluppo dell'adattatore ioBroker.radar2, l'ulteriore sviluppo dell'adattatore ioBroker.radar è stato interrotto. Si prega di installare il nuovo adattatore per ottenere più funzionalità.",
            "es": "Debido al desarrollo del adaptador ioBroker.radar2, el desarrollo adicional del adaptador ioBroker.radar se ha interrumpido. Instale el nuevo adaptador para obtener más características.",
            "pl": "Dzięki rozwojowi adaptera ioBroker.radar2, dalszy rozwój adaptera ioBroker.radar został przerwany. Zainstaluj nowy adapter, aby uzyskać więcej funkcji.",
            "zh-cn": "由于ioBroker.radar2适配器的开发，ioBroker.radar适配器的进一步开发已经停止。 请安装新适配器以获得更多功能。"
        },
        "id": "radar",
        "created": "2019-03-22T00:00:00.000Z",
        "conditions": {
            "radar": "installed",
            "radar2": "!installed"
        }
    },
    {
        "title": {
            "en": "Please update ioBroker.weatherunderground",
            "de": "Bitte updaten Sie ioBroker.weatherunderground",
            "ru": "Пожалуйста, обновление ioBroker.weatherunderground",
            "pt": "Por favor, atualize ioBroker.weatherunderground",
            "nl": "Update ioBroker.weatherunderground",
            "fr": "Veuillez mettre à jour ioBroker.weatherunderground",
            "it": "Si prega di aggiornare ioBroker.weatherunderground",
            "es": "Por favor, actualice ioBroker.weatherunderground",
            "pl": "Proszę aktualizacja ioBroker.weatherunderground",
            "zh-cn": "请更新的ioBroker。weatherunderground"
        },
        "content": {
            "en": "Due to changes to the API, versions below 3.0.0 no longer work. Please update your version of ioBroker.weatherunderground.",
            "de": "Wegen Änderungen der API, funktionieren Versionen unter 3.0.0 nicht mehr. Bitte aktualisieren Sie Ihre Version von ioBroker.weatherunderground.",
            "ru": "Из-за изменений в API, версий ниже 3.0.0 больше не работают. Пожалуйста, обновите вашу версию ioBroker.weatherunderground.",
            "pt": "Devido a alterações para a API, versões abaixo 3.0.0 não funcionam mais. Por favor, atualize sua versão do ioBroker.weatherunderground.",
            "nl": "Door veranderingen aan de API versies hieronder 3.0.0 niet meer werken. Update uw versie van ioBroker.weatherunderground.",
            "fr": "En raison des changements de l'API, les versions ci-dessous 3.0.0 ne fonctionnent plus. Veuillez mettre à jour votre version de ioBroker.weatherunderground.",
            "it": "A causa di modifiche alle API, versioni di seguito 3.0.0 non funzionano più. Si prega di aggiornare la tua versione di ioBroker.weatherunderground.",
            "es": "Debido a cambios en el API, las versiones a continuación 3.0.0 ya no funcionan. Por favor, actualice su versión de ioBroker.weatherunderground.",
            "pl": "Ze względu na zmiany w API w wersji poniżej 3.0.0 już nie pracują. Proszę zaktualizować swoją wersję ioBroker.weatherunderground.",
            "zh-cn": "由于变化的API，下文版本为3.0.0不再工作。 请更新版本的的ioBroker。weatherunderground的。"
        },
        "id": "weatherundergroundAdapter",
        "fa-icon": "sun-o",
        "created": "2019-03-24T00:00:00.000Z",
        "conditions": {
            "weatherunderground": "smaller(3.0.0)"
        }
    },
    {
        "title": {
            "en": "The latest version of JS-Controller 2.x is not compatible with the email-adapter smaller than 1.0.5",
            "de": "Die neueste Version von JS-Controller 2.x ist nicht mit dem E-Mail-Adapter kleiner als 1.0.5 kompatibel",
            "ru": "Последняя версия JS-Controller 2.x не совместима с почтовым адаптером меньше, чем 1.0.5",
            "pt": "A versão mais recente do JS-Controller 2.x não é compatível com o adaptador de email menor que 1.0.5",
            "nl": "De nieuwste versie van JS-Controller 2.x is niet compatibel met de e-mailadapter kleiner dan 1.0.5",
            "fr": "La dernière version de JS-Controller 2.x n'est pas compatible avec l'adaptateur de messagerie électronique inférieur à 1.0.5.",
            "it": "L'ultima versione di JS-Controller 2.x non è compatibile con l'adattatore di posta elettronica inferiore alla 1.0.5",
            "es": "La última versión de JS-Controller 2.x no es compatible con el adaptador de correo electrónico más pequeño que 1.0.5",
            "pl": "Najnowsza wersja JS-Controller 2.x nie jest kompatybilna z adapterem poczty elektronicznej mniejszym niż 1.0.5",
            "zh-cn": "JS-Controller 2.x的最新版本与小于1.0.5的电子邮件适配器不兼容"
        },
        "content": {
            "en": "If you want to install the current beta version of the JS controller 2.x, first update the email-adapter to a version 1.0.5 or higher.",
            "de": "Wenn Sie die aktuelle Betaversion des JS-Controllers 2.x installieren möchten, aktualisieren Sie zuerst den E-Mail-Adapter auf eine Version 1.0.5 oder höher.",
            "ru": "Если вы хотите установить текущую бета-версию JS-контроллера 2.x, сначала обновите email-адаптер до версии 1.0.5 или выше.",
            "pt": "Se você deseja instalar a versão beta atual do controlador JS 2.x, primeiro atualize o adaptador de email para uma versão 1.0.5 ou superior.",
            "nl": "Als u de huidige bètaversie van de JS-controller 2.x wilt installeren, werkt u eerst de e-mailadapter bij naar versie 1.0.5 of hoger.",
            "fr": "Si vous souhaitez installer la version bêta actuelle du contrôleur JS 2.x, mettez d'abord à jour l'adaptateur de messagerie électronique vers une version 1.0.5 ou ultérieure.",
            "it": "Se si desidera installare la versione beta corrente del controller JS 2.x, aggiornare innanzitutto l'adattatore di posta elettronica con una versione 1.0.5 o successiva.",
            "es": "Si desea instalar la versión beta actual del controlador JS 2.x, primero actualice el adaptador de correo electrónico a una versión 1.0.5 o superior.",
            "pl": "Jeśli chcesz zainstalować bieżącą wersję beta kontrolera JS 2.x, najpierw zaktualizuj adapter poczty e-mail do wersji 1.0.5 lub nowszej.",
            "zh-cn": "如果要安装JS控制器2.x的当前beta版本，请首先将email-adapter更新为1.0.5或更高版本。"
        },
        "id": "email",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-10-09T00:00:00.000Z",
        "conditions": {           
            "email": "smaller(1.0.5)"
        }
    },
    {
        "title": {
            "en": "The latest version of JS-Controller 2.x is not compatible with the pushover-adapter smaller than 1.1.1",
            "de": "Die neueste Version von JS-Controller 2.x ist nicht mit dem Pushover-Adapter kleiner als 1.1.1 kompatibel",
            "ru": "Последняя версия JS-Controller 2.x не совместима с адаптером pushover меньше 1.1.1",
            "pt": "A versão mais recente do JS-Controller 2.x não é compatível com o adaptador pushover menor que 1.1.1",
            "nl": "De nieuwste versie van JS-Controller 2.x is niet compatibel met de pushover-adapter kleiner dan 1.1.1",
            "fr": "La dernière version de JS-Controller 2.x n'est pas compatible avec l'adaptateur intermédiaire supérieur à 1.1.1.",
            "it": "L'ultima versione di JS-Controller 2.x non è compatibile con l'adattatore pushover più piccolo di 1.1.1",
            "es": "La última versión de JS-Controller 2.x no es compatible con el adaptador pushover más pequeño que 1.1.1",
            "pl": "Najnowsza wersja JS-Controller 2.x nie jest kompatybilna z adapterem pushover mniejszym niż 1.1.1",
            "zh-cn": "JS-Controller 2.x的最新版本与小于1.1.1的pushover-adapter不兼容"
        },
        "content": {
            "en": "If you want to install the current beta version of the JS controller 2.x, first update the pushover-adapter to a version 1.1.1 or higher.",
            "de": "Wenn Sie die aktuelle Betaversion des JS-Controllers 2.x installieren möchten, aktualisieren Sie zuerst den Pushover-Adapter auf eine Version 1.1.1 oder höher.",
            "ru": "Если вы хотите установить текущую бета-версию JS-контроллера 2.x, сначала обновите pushover-адаптер до версии 1.1.1 или выше.",
            "pt": "Se você deseja instalar a versão beta atual do controlador JS 2.x, primeiro atualize o adaptador pushover para uma versão 1.1.1 ou superior.",
            "nl": "Als u de huidige bètaversie van de JS-controller 2.x wilt installeren, werkt u eerst de pushover-adapter bij naar een versie 1.1.1 of hoger.",
            "fr": "Si vous souhaitez installer la version bêta actuelle du contrôleur JS 2.x, mettez d'abord à jour l'adaptateur pushover avec une version 1.1.1 ou ultérieure.",
            "it": "Se si desidera installare la versione beta corrente del controller JS 2.x, aggiornare innanzitutto l'adattatore pushover a una versione 1.1.1 o successiva.",
            "es": "Si desea instalar la versión beta actual del controlador JS 2.x, primero actualice el adaptador pushover a una versión 1.1.1 o superior.",
            "pl": "Jeśli chcesz zainstalować bieżącą wersję beta kontrolera JS 2.x, najpierw zaktualizuj adapter pushover do wersji 1.1.1 lub nowszej.",
            "zh-cn": "如果要安装JS控制器2.x的当前beta版本，请首先将pushover-adapter更新到1.1.1或更高版本。"
        },
        "id": "pushover",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-10-09T00:00:00.000Z",
        "conditions": {           
            "pushover": "smaller(1.1.1)"
        }
    },
    {
        "title": {
            "en": "The latest version of JS-Controller 2.x is not compatible with the HUE-adapter smaller than 1.2.4",
            "de": "Die neueste Version von JS-Controller 2.x ist nicht mit dem HUE-Adapter kleiner als 1.2.4 kompatibel",
            "ru": "Последняя версия JS-Controller 2.x несовместима с HUE-адаптером, меньшим, чем 1.2.4.",
            "pt": "A versão mais recente do JS-Controller 2.x não é compatível com o adaptador HUE menor que 1.2.4",
            "nl": "De nieuwste versie van JS-Controller 2.x is niet compatibel met de HUE-adapter kleiner dan 1.2.4",
            "fr": "La dernière version de JS-Controller 2.x n'est pas compatible avec l'adaptateur HUE inférieur à 1.2.4.",
            "it": "L'ultima versione di JS-Controller 2.x non è compatibile con l'adattatore HUE più piccolo di 1.2.4",
            "es": "La última versión de JS-Controller 2.x no es compatible con el adaptador HUE más pequeño que 1.2.4",
            "pl": "Najnowsza wersja JS-Controller 2.x nie jest kompatybilna z adapterem HUE mniejszym niż 1.2.4",
            "zh-cn": "最新版本的JS-Controller 2.x与小于1.2.4的HUE-adapter不兼容"
        },
        "content": {
            "en": "If you want to install the current beta version of the JS controller 2.x, first update the HUE-adapter to a version 1.2.4 or higher.",
            "de": "Wenn Sie die aktuelle Beta-Version des JS-Controllers 2.x installieren möchten, aktualisieren Sie zuerst den HUE-Adapter auf eine Version 1.2.4 oder höher.",
            "ru": "Если вы хотите установить текущую бета-версию JS-контроллера 2.x, сначала обновите HUE-адаптер до версии 1.2.4 или выше.",
            "pt": "Se você deseja instalar a versão beta atual do controlador JS 2.x, primeiro atualize o adaptador HUE para uma versão 1.2.4 ou superior.",
            "nl": "Als u de huidige bètaversie van de JS-controller 2.x wilt installeren, werkt u eerst de HUE-adapter bij naar een versie 1.2.4 of hoger.",
            "fr": "Si vous souhaitez installer la version bêta actuelle du contrôleur JS 2.x, commencez par mettre à jour l'adaptateur HUE vers une version 1.2.4 ou ultérieure.",
            "it": "Se si desidera installare la versione beta corrente del controller JS 2.x, aggiornare prima l'adattatore HUE a una versione 1.2.4 o successiva.",
            "es": "Si desea instalar la versión beta actual del controlador JS 2.x, primero actualice el adaptador HUE a una versión 1.2.4 o superior.",
            "pl": "Jeśli chcesz zainstalować bieżącą wersję beta kontrolera JS 2.x, najpierw zaktualizuj adapter HUE do wersji 1.2.4 lub nowszej.",
            "zh-cn": "如果要安装JS控制器2.x的当前beta版本，请首先将HUE-adapter更新到1.2.4或更高版本。"
        },
        "id": "hue",
        "class": "warning",
        "fa-icon": "exclamation-triangle",
        "created": "2019-10-09T00:00:00.000Z",
        "conditions": {           
            "hue": "smaller(1.2.4)"
        }
    },
    {
        "title": {
            "en": "Do not update the JS-Controller to 2.x with npm in Windows systems",
            "de": "Aktualisieren Sie den JS-Controller nicht mit npm auf 2.x in Windows",
            "ru": "Не обновляйте JS-контроллер до 2.x с npm в системах Windows",
            "pt": "Não atualize o JS-Controller para 2.x com npm nos sistemas Windows",
            "nl": "Werk de JS-Controller niet bij naar 2.x met npm in Windows-systemen",
            "fr": "Ne mettez pas à jour le JS-Controller vers 2.x avec npm sur les systèmes Windows",
            "it": "Non aggiornare JS-Controller a 2.x con npm nei sistemi Windows",
            "es": "No actualice el controlador JS a 2.x con npm en sistemas Windows",
            "pl": "Nie aktualizuj kontrolera JS do wersji 2.x z npm w systemach Windows",
            "zh-cn": "不要在Windows系统中使用npm将JS-Controller更新到2.x"
        },
        "content": {
            "en": "On systems set up with the new Windows Installer, the JS-Controller 2.x can not be updated with npm. There will be a new version of the Windows Installer, which allows the update of the js-controller with a few mouse clicks.",
            "de": "Auf Systemen, die mit dem neuen Windows Installer eingerichtet wurden, kann der JS-Controller 2.x nicht mit npm aktualisiert werden. Es wird eine neue Version des Windows Installers geben, mit der sich der js-controller mit wenigen Mausklicks aktualisieren lässt.",
            "ru": "В системах, настроенных с помощью нового установщика Windows, JS-Controller 2.x не может быть обновлен с помощью npm. Появится новая версия установщика Windows, которая позволяет обновлять js-контроллер несколькими щелчками мыши.",
            "pt": "Nos sistemas configurados com o novo Windows Installer, o JS-Controller 2.x não pode ser atualizado com o npm. Haverá uma nova versão do Windows Installer, que permite a atualização do controlador js com apenas alguns cliques do mouse.",
            "nl": "Op systemen die zijn ingesteld met de nieuwe Windows Installer, kan de JS-Controller 2.x niet worden bijgewerkt met npm. Er komt een nieuwe versie van Windows Installer, waarmee de js-controller met een paar muisklikken kan worden bijgewerkt.",
            "fr": "Sur les systèmes configurés avec le nouveau Windows Installer, JS-Controller 2.x ne peut pas être mis à jour avec npm. Il y aura une nouvelle version de Windows Installer, qui permet la mise à jour du contrôleur js en quelques clics de souris.",
            "it": "Sui sistemi configurati con il nuovo Windows Installer, JS-Controller 2.x non può essere aggiornato con npm. Ci sarà una nuova versione di Windows Installer, che consente l'aggiornamento del controller js con pochi clic del mouse.",
            "es": "En los sistemas configurados con el nuevo Windows Installer, el JS-Controller 2.x no se puede actualizar con npm. Habrá una nueva versión del Instalador de Windows, que permite la actualización del controlador js con unos pocos clics del mouse.",
            "pl": "W systemach skonfigurowanych za pomocą nowego Instalatora Windows, JS-Controller 2.x nie może być aktualizowany przy pomocy npm. Pojawi się nowa wersja Instalatora Windows, która umożliwia aktualizację kontrolera js kilkoma kliknięciami myszy.",
            "zh-cn": "在使用新的Windows Installer设置的系统上，无法使用npm更新JS-Controller2.x。 Windows Installer将有一个新版本，只需单击几下鼠标，即可更新js-controller。"
        },
        "id": "js-controller",
        "os": "win32",
        "class": "warning",
        "fa-icon": "windows",
        "created": "2019-10-10T00:00:00.000Z",
        "conditions": {
            "js-controller": "smaller(2.0.0)",
            "info": "bigger(1.5.4)",
            "admin": "bigger(3.6.7)"            
        }
    },
    {
        "title": {
            "en": "Node.JS versions smaller than 8 will be soon deprecated",
            "de": "Node.JS-Versionen, die kleiner als 8 sind, werden bald nicht mehr unterstützt",
            "ru": "Версии Node.JS, меньшие 8, скоро будут устаревшими",
            "pt": "Versões do Node.JS menores que 8 serão descontinuadas em breve",
            "nl": "Node.JS-versies kleiner dan 8 worden binnenkort verouderd",
            "fr": "Les versions de Node.JS inférieures à 8 seront bientôt obsolètes",
            "it": "Le versioni di Node.JS inferiori a 8 saranno presto deprecate",
            "es": "Las versiones de Node.JS más pequeñas que 8 pronto serán desaprobadas",
            "pl": "Wersje Node.JS mniejsze niż 8 zostaną wkrótce wycofane",
            "zh-cn": "小于8的Node.JS版本将很快被弃用"
        },
        "content": {
            "en": "With the upcoming version 2 of the JS-controller, the support of Node.JS versions smaller than 8.x.x will be discontinued. Please update your system to a higher version. We recommend the Node.JS version 10.x.x.",
            "de": "Mit der kommenden Version 2 des JS-Controllers wird die Unterstützung von Node.JS-Versionen kleiner als 8.x.x eingestellt. Bitte aktualisieren Sie Ihr System auf eine höhere Version. Wir empfehlen die Node.JS-Version 10.x.x.",
            "ru": "С выходом второй версии JS-контроллера поддержка версий Node.JS, меньших 8.x.x, будет прекращена. Пожалуйста, обновите вашу систему до более поздней версии. Мы рекомендуем Node.JS версии 10.x.x.",
            "pt": "Com a próxima versão 2 do controlador JS, o suporte às versões do Node.JS menores que 8.x.x será descontinuado. Atualize seu sistema para uma versão superior. Recomendamos a versão 10.x.x do Node.JS.",
            "nl": "Met de komende versie 2 van de JS-controller wordt de ondersteuning van Node.JS-versies kleiner dan 8.x.x stopgezet. Werk uw systeem bij naar een hogere versie. We raden de Node.JS-versie 10.x.x aan.",
            "fr": "Avec la prochaine version 2 du contrôleur JS, le support des versions de Node.JS inférieures à 8.x.x sera supprimé. Veuillez mettre à jour votre système avec une version supérieure. Nous recommandons la version 10.x.x de Node.JS.",
            "it": "Con la prossima versione 2 del controller JS, il supporto delle versioni Node.JS inferiori a 8.x.x verrà sospeso. Si prega di aggiornare il sistema a una versione successiva. Consigliamo Node.JS versione 10.x.x.",
            "es": "Con la próxima versión 2 del controlador JS, se suspenderá el soporte de las versiones Node.JS más pequeñas que 8.x.x. Actualice su sistema a una versión superior. Recomendamos el Node.JS versión 10.x.x.",
            "pl": "W nadchodzącej wersji 2 kontrolera JS obsługa Node.JS w wersji mniejszej niż 8.x.x zostanie przerwana. Zaktualizuj system do wyższej wersji. Zalecamy wersję 10.x.x. Node.JS",
            "zh-cn": "随着即将发布的JS-controller版本2，将不再支持小于8.x.x的Node.JS版本。请更新您的系统到更高版本。我们建议使用Node.JS版本10.x.x。"
        },
        "id": "js-controller",
        "node-version": "smaller(8.0.0)",
        "class": "warning",
        "fa-icon": "ban",
        "created": "2019-09-24T00:00:00.000Z",
        "conditions": {           
            "admin": "bigger(3.6.6)"
        }
    }
]
